{"data":{"markdownRemark":{"html":"<p>1and1 changed their pricing structure for their Beginner Package on March 22, 2007 from $2.99 to $3.99 per month. I purchased six months in advance, so the price was only $8.97 (50% off of total fee). I'm not sure if the discount was due to pre-payment or due to a coupon code (aka promotional code, promo code, etc.). Regardless, even though I've found their network performance to be superior from my limited scope of the Comcast and Verizon networks<sup><a href=\"#ref1\">1</a></sup> (see comment about this below), I will cancel hosting service subscription with 1and1. I'm interested to find how easily I can transfer the domain I registered with 1and1.com to another registrar.</p>\n<p>The process of canceling my 1and1 Beginner Hosting Package:</p>\n<ol><li>Transfer non-registered domains to another DNS provider. In my case: myself. I use MyDNS and MySQL to manage my own DNS - Done.</li><li>Transfer 1and1 registered domain to another registrar. - Started:<ul><li>Transferring domains is always a pain, but this time it wasn't so bad. Only problem I had was with finding the authorization code at 1and1. It was under the Info button, then under the selected domain.</li><li>Hmm, maybe this is going to be a pain. I've authorized the transfer with GoDaddy under the Authorization tab and provided the transaction id and authorization code GoDaddy sent me, then I submitted the authorization code that 1and1 gave me, now what?</li><li>GoDaddy recommended action: \"Accept transfer at current registrar\"</li></ul></li><li>See if you can cancel the account via the admin panel, and email them as well to make sure the cancel is processed.</li></ol>\n<p>I have to say I'm pretty annoyed with 1and1. To cancel your account, you have to go to a separate domain and login,  request a cancellation, and then confirm the cancellation from an email they send you.  I haven't received the email yet. I just got the email, and I'm amazed that they say this:</p>\n<blockquote>Please note, in addition, that you are required to return all written\ndocumentation received from 1&1 and any software CD which you may have\nordered.</blockquote>\n<p>They have got to be kidding! I'm guessing that 1and1 sends out a physical item (even though I never requested or received anything from them) to enable them to claim the transaction was something (a purchase of a physical product) it really was not (it was a service).</p>\n<p>I sent them the following emails:</p>\n<blockquote>Hello:\n<p>Please cancel account --------. Based upon the email you send out earlier this year regarding a price change for the beginner package, any contract we may have had is now null and void. Do not make any additional charges to the credit card I supplied upon registration.</p>\n<p>Sincerely, </blockquote></p>\n<p>and</p>\n<blockquote>\nHello,\n<p>I noticed that you included the following statement in the cancellation process dialogues, but I never ordered anything or received any written documentation from you:</blockquote></p>\n<p>Moving my domain registration away from 1and1 to another registrar is proving incredibly difficult and a complete waste of time. Shame on 1and1 for not making this process simpler. Their FAQs contain several solutions on how to transfer domains into 1and1, but when I searched for \"domains\" via their search tool, and then used my browser to search, no results were found for the terms \"out\" or \"away\". That is bad business in my humble opinion.</p>\n<p>Still haven't been able to transfer my domain away from 1and1, so I sent them this email tonight:</p>\n<blockquote>The domain was unlocked before the transfer request was made. I double checked that it was unlocked (it was) and re-initiated the request and still have not received confirmation that the domain was transferred, yet my account has been deactivated and is no longer accessible.</blockquote>\n<p>They wrote back:</p>\n<blockquote>Thank you for contacting us.\n<p>Per record the unlock status was completed on May 11,2007.\nThe transfer request was prior to the date the lock has been fully\nremove.\nThus, you will need to contact Go daddy and re-initiate a transfer\nrequest.</p>\n<p>If you have any further questions please do not hesitate to contact us.</blockquote></p>\n<p>I replied back:</p>\n<blockquote>\nHello,\n<p>I have re-initiated the request and GoDaddy is reporting I'm supposed to approve the transfer at the current registrar. How can I do that without any account access?</p>\n<p>Thanks,</p>\n</blockquote>\n<p>Its been over a week and I've spent several hours trying to transfer my domain. Too bad, what a waste, all because in my opinion 1and1 makes it difficult to stop using them as a hosting provider. I'm disappointed.</p>\n<p>GoDaddy just emailed this to me:</p>\n<blockquote>\nThank you for contacting Online Support. A request to transfer SCHEMATRONIC.COM has been submitted to the domain's Registry. The Registry will contact the current Registrar to make a final verification of the transfer. At present we are waiting on them to respond to this request. Some Registrars will try to verify requests of this kind before accepting them. Be sure to respond to any correspondence from your current Registrar in a timely manner or they may hold the domain. However, if the Registrar does not respond for a period of 5-7 days, the Registry will release the domain to us. This is what happens with many Registrars, so it may be a few days before the transfer is complete. Once Go Daddy has been informed of the outcome we will let you know.</blockquote>\n<p>And I should also mention that 1and1 issued a $2.95 credit to my credit card. Interesting.</p>\n<p>References:</p>\n<ol><li id=\"ref1\">Network performance is very difficult to measure because of the client - server relationship. A server hosting network could perform well for one client browser's network and not for another.</li></ol>\n<p>¥</p>","frontmatter":{"title":"1and1.com Price Change for Beginner Package","date":"May 9th, 2007"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2007/2007-05-09-1and1com-price-change-for-beginner-package/"}}