{"data":{"markdownRemark":{"html":"<p>I performed some updates on a server I manage which runs Gentoo today. There were a couple of hitches:</p>\n<pre class=\"sh_sh\">\n* Messages for package net-misc/neon-0.26.3:\n* There are new features in this version; please beware that\n* upstream considers the socks support experimental.  If you\n* experience test failures (eg, bug 135863) then try rebuilding\n* glibc. *\n* Neon has a policy of breaking API across versions, this means\n* that any packages that link against neon will be broken after\n* updating. They will remain broken until they are ported to the\n* new API. You can downgrade neon to the previous version by doing...\n</pre>\n<p>The first one, neon, doesn't seem to pose a problem, because I also updated subversion. The second isn't a big deal, because I mostly access the server remote. I also haven't had any problems with kbd though, I just think its odd if failed to emerge.</p>\n<p>Also updated an even older gentoo machine, but had some problems with mysql:</p>\n<pre class=\"sh_sh\">\n[ERROR] Fatal error: mysql.user table is damaged or in unsupported 3.20 format.\n</pre>\n<p><a rel=\"nofollow\" href=\"http://www.john-hunt.com/linux/2006/05/12/mysql-upgrade-breaking-things/\">http://www.john-hunt.com/linux/2006/05/12/mysql-upgrade-breaking-things/\n</a></p>\n<p><a rel=\"nofollow\" href=\"http://dev.mysql.com/doc/refman/5.0/en/mysql-upgrade.html\">http://dev.mysql.com/doc/refman/5.0/en/mysql-upgrade.html\n</a></p>\n<p>The MySQL bit was actually quite a pain, but eventually it worked out. I pretty much had to rebuild the user db, but thankfully I only had a few users - root and an average user. I used:</p>\n<pre class=\"sh_sh\">\nmysqld_safe --skip-grant-tables --user=root &amp;\n</pre>\n<p>as suggested by John Hunt, but I'm posting it above because his Wordpress is doing funky things to the characters making it hard to cut and paste into a terminal.</p>\n<p>It sure is an odd experience managing both gentoo and debian machines, they are so different! Again one of these machines is really old - running a Gentoo install from several years back. The biggest problem with that upgrade is that the machine lost track of the HD ids. No longer able to find\n<strong>/dev/sdaX</strong>, I had to rebuild /etc/fstab with the likes of this:</p>\n<p><strong>/dev/scsi/host0/bus0/target1/lun0/part1</strong></p>\n<p>I did run into some more minor issues too though:</p>\n<pre class=\"sh_sh\">\n* This package will overwrite one or more files that may belong to other\n* packages (see list below). Add \"collision-protect\" to FEATURES in\n* make.conf if you would like the merge to abort in cases like this. You\n* can use a command such as `portageq owners / ` to identify\n* the installed package that owns a file. If portageq reports that only\n* one package owns a file then do NOT file a bug report. A bug report is\n* only useful if it identifies at least two or more packages that are\n* known to install the same file(s). If a collision occurs and you can\n* not explain where the file came from then you should simply ignore the\n* collision since there is not enough information to determine if a real\n* problem exists. Please do NOT file a bug report at\n* http://bugs.gentoo.org unless you report exactly which two packages\n* install the same file(s). Once again, please do NOT file a bug report\n* unless you have completely understood the above message.\n*  * Detected file collision(s): *  *      /usr/sbin/python-updater\nrevdep-rebuild -X --library libexpat.so.0\n* Any package that linked against the previous version\n* of gettext will have to be rebuilt.\n* Please 'emerge gentoolkit' and run:\n* revdep-rebuild --library libintl.so.7\n* PLEASE PLEASE take note of this\n* Please make *sure* to run revdep-rebuild now\n* Certain things on your system may have linked against a\n* different version of com_err -- those things need to be\n* recompiled.  Sorry for the inconvenience\n* You have had multiple versions of perl. It is recommended\n* that you run perl-cleaner now. perl-cleaner will\n* assist with this transition. This script is capable\n* of cleaning out old .ph files, rebuilding modules for\n* your new version of perl, as well as re-emerging\n* applications that compiled against your old libperl.so *\n* PLEASE DO NOT INTERRUPT THE RUNNING OF THIS SCRIPT.\n* Part of the rebuilding of applications compiled against\n* your old libperl involves temporarily unmerging\n* them - interruptions could leave you with unmerged\n* packages before they can be remerged. *\n* If you have run perl-cleaner and a package still gives\n* you trouble, and re-emerging it fails to correct\n* the problem, please check http://bugs.gentoo.org/\n* for more information or to report a bug. *  *\n</pre>\n<p>This one reminds me of the pam / shadow dual-block:</p>\n<pre class=\"sh_sh\">\n*\n* Your current setup is using the pam_stack module.\n* This module is deprecated and no longer supported, and since version\n* 0.99 is no longer installed, nor provided by any other package.\n* The package will be built (to allow binary package builds), but will\n* not be installed.\n* Please replace pam_stack usage with proper include directive usage,\n* following the PAM Upgrade guide at the following URL\n*   http://www.gentoo.org/proj/en/base/pam/upgrade-0.99.xml\n</pre>\n<p>What I did:</p>\n<pre class=\"sh_sh\">\nauth    include      system-auth\naccount    include      system-auth\npassword        include      system-auth\nsession         include      system-auth\n</pre>\n<p>And this is fine:</p>\n<pre>\n*  * If you have just upgraded from an older version of python you * will need to run:\n*  * /usr/sbin/python-updater\n*  * This will automatically rebuild all the python dependent modules * to run with python-2.4.\n*  * Your original Python is still installed and can be accessed via * /usr/bin/python2.x. *\n</pre>\n<p>But I didn't have python-updater, it was blocked by my current version: 2.3.5.\n<a rel=\"nofollow\" href=\"http://forums.gentoo.org/viewtopic-p-4528367.html\">This forum thread\n</a> helped me figure out what to do:</p>\n<pre class=\"sh_sh\">\nemerge --nodeps -v =dev-lang/python-2.4.4-r5\n</pre>\n<p>Only after that could I emerge -C =dev-land/python-2.3.5 and emerge python-updater.</p>\n<p>Running Gentoo is definitely more stressful for me than running debian from time to time, but at the same point, I also find it a bit more satisfying as well, as I fell like I'm more in control and able to make more precise decisions. Its a trade off I guess.</p>\n<h4><b>Upgrading linux from 2.4 to 2.6</b></h4>\n<p>Told you one of my gentoo machines was old:</p>\n<pre>\n* You need a kernel of at least version 2.6.9 * for NPTL support! *\n* ERROR: sys-libs/glibc-2.6.1 failed.\n* Call stack:\n*            ebuild.sh, line 1701:  Called dyn_unpack\n*            ebuild.sh, line  817:  Called qa_call 'src_unpack'\n*            ebuild.sh, line   44:  Called src_unpack\n*   glibc-2.6.1.ebuild, line  154:  Called eblit-run 'src_unpack'\n*   glibc-2.6.1.ebuild, line  150:  Called eblit-glibc-src_unpack\n*     src_unpack.eblit, line  117:  Called toolchain-glibc_src_unpack\n*     src_unpack.eblit, line   55:  Called check_nptl_support\n*     src_unpack.eblit, line   32:  Called die\n* The specific snippet of code:\n*                      die \"Kernel version too low!\"\n*  The die message:\n*   Kernel version too low! *\n* If you need support, post the topmost build error, and the call stack if relevant.\n* A complete build log is located at '/var/tmp/portage/sys-libs/glibc-2.6.1/temp/build.log'. *\n* GNU info directory index is up-to-date.\n</pre>\n<p>Its running 2.4.28-grsec-2.1.0. I'm now updating to a non-grsec kernel : sys-kernel/gentoo-sources-2.6.22-r9. I've already switched to a standard profile, and am already using a standard gcc profile, so I\n<strong><em>hope</em></strong> it will be OK. I'm not sure exactly what kernel configuration I'll need though, so I'm very thankful that I have this machine hooked up to a KVM over IP box so I can easily choose the original kernel. :-)</p>\n<p>I'll probably check to see if I have a config for my 2.4 kernel, but I'm doubtful that it would be friendly to the 2.6 menuconfig. Since I compiled the 2.4 kernel, I've learned a lot about how its done. Gentoo was the platform I really learned how to compile a kernel on my own, but I've since done it many many times on my various debian boxes, to\n<a href=\"http://www.docunext.com/\">enable /dev/crypto via ocf-linux\n</a> as well as trying to enable better\n<a href=\"http://www.docunext.com//pc_chips_v21g___40__v1.0c__41___via_c7/\">via C7 acpi cpufreq capabilities\n</a>. Thankfully, they do have a\n<a href=\"http://www.gentoo.org/doc/en/migration-to-2.6.xml\" rel=\"nofollow\">Gentoo migration to 2.6 guide\n</a>. Most of it doesn't relate to me, but I was glad to read it anyway, at least to learn that make oldconfig won't work.</p>\n<p>AWESOME! It worked, I'm now running Gentoo's 2.6.22 kernel. :-)</p>","frontmatter":{"title":"Gentoo Updates","date":"November 23rd, 2007"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2007/11/gentoo-updates/"}}