{"data":{"markdownRemark":{"html":"<p>I upgraded my Lenovo g555 laptop to Ubuntu Oneric Ocelot on Friday and it was\na little rocky, but now its working really well.</p>\n<p>I have setup a few new / different items:</p>\n<ul>\n<li>I'm using the ATI proprietary driver, much to my chagrin solely because it\ngets less hot than the open source one. As far as performance goes, I don't\nnotice a difference, but no doubt - KMS is awesome. The raw terminals look\nmagnificient. Specifically, using this makes all the difference:</li>\n</ul>\n<pre> amdconfig --px-igpu </pre>\n<ul>\n<li>I am now using ext4 for the /home directory. I was hesitant to use ext4\nbecause ext3 is so reliable, but then I read about some basic performance\nfactors - like extents specifically, so I'm giving it a go.</li>\n<li>While I'm using OpenVZ extensively these days, I'm now checking out LXC for\na development environment on my laptop. I actually just setup another user\naccount \"app\" that I ssh into (yes, ssh'ing to the same machine - for ssh\nforwarding), and that's working OK because I've got Ruby installed with rbenv,\nbut I want to encapsulate mysql, and I don't want it polluting my base\nworkstation OS.</li>\n<li>\n<p>I'm also using libnss-extrausers because it is awesome - I'd rather use\nsomething like puppet or csync2 to manage hard files instead of using ldap</p>\n<ul>\n<li>maybe even something like git-annex for that, or maybe just plain git.</li>\n</ul>\n</li>\n</ul>\n<p>I'm still doing plenty the same:</p>\n<ul>\n<li>Gnome + Awesome</li>\n<li>Still using rbenv, homesick, and major dotfiles in my home directories (which\nis why I split my laptop user with the development user)</li>\n<li>Still using jEdit, sorta.</li>\n</ul>\n<p>I'm no longer using:</p>\n<ul>\n<li>Picasa3 - see ya! I'm tired of Wine, and realized I can manage my images\nbetter than Picasa can.</li>\n<li>No longer bothering with the default folders in my home</li>\n</ul>\n<p>Other stuff catching my attention:</p>\n<ul>\n<li>Fuse BindFS</li>\n<li>mbr</li>\n<li>mr (not related)</li>\n<li>caspar ( see <a href=\"http://www.hoppie.nl/pub/node/79\">this</a>)</li>\n</ul>\n<p>Probably going to stick with csync2, maybe? Actually I'm liking the idea of\nsimply using git more and more. There are actually plenty of folks doing this,\nand here's the best example I found:</p>\n<ul>\n<li><a href=\"http://git.rot13.org/?p=bak-git.git;a=blob;f=bak-git-server.pl;hb=HEAD\">http://git.rot13.org/?p=bak-git.git;a=blob;f=bak-git-server.pl;hb=HEAD</a></li>\n</ul>","frontmatter":{"title":"LXC on Ubuntu 11.10 Looks Good","date":"2011-12-25T00:00:00.000Z"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2011/2011-12-25-lxc-on-ubuntu-1110-looks-good/"}}