{"data":{"markdownRemark":{"html":"<p><b><font style=\"font-size: 1.5625em;\">Dreamhost</font></b></p>\n<p>Dreamhost's biggest asset is their control panel, no doubt about it. Its user friendly, comprehensive, though maybe a bit slow from time to time.</p>\n<p><strong>Dreamhost Control Panel</strong>\nDreamhost recently upgraded their panel and it looks great! Only problem is that something they updated broke several of my MediaWiki installs. I don't think they like it when you take database connections into your own hands.<strong></p>\n<p>Dreamhost Spam Policies</strong>SPAM is one of the worst things about the internet, and it has had an impact on the service Dreamhost can offer its customers. The person who introduced me to dreamhost.com over 4 years ago is now leaving dreamhost because of their email list limitations. <strong></p>\n<p>The Problem with <a href=\"http://www.docunext.com/blog/shared-hosting.html\">Shared Hosting</a></strong>\nMarch 23, 2007\nYesterday, all my domains that I host at Dreamhost.com were unavailable for the majority of the day. I emailed support and about 4 hours later they responded with this message:</p>\n<p>''Hello,</p>\n<p>There was another user on the machine running processes that were over consuming system resources. We have disabled that users account. The\nmachine is now stable. We apologize for any inconvenience this may have\ncaused. If you have any additional questions, please let us know.</p>\n<p>Thanks!''</p>\n<p>That issue represents the major problem with shared hosting, also known as the \"bad neighbor\" problem. I'm surprised Dreamhost doesn't monitor process utilization on their servers to catch this type of problem at the outset.</p>\n<p>Unfortunately, it appears that the same thing is happening again today, March 24, 2007. I emailed them again and got this response:</p>\n<p>''I'm sorry for the problems you've been experiencing. It looks like were\nstill having some Network File system problems that is causing your\nservices to have problems. Our admins are currently looking into this\nproblem. You can get more details and updates regarding this problem at\n<a href=\"http://www.dreamhoststatus.com/\">http://www.dreamhoststatus.com/</a></p>\n<p>Again, I do apologize for the inconvenience. Please let me know if you\nhave any other questions or concerns.''</p>\n<p>And their status pages displays this information:\n''We are experiencing connection problems with the file storage system that the following machines are mounted to. This is causing inflated loads on some of the machines. As a result making your website unresponsive. Our Admins are diligently working towards resolving this issue. We sincerely apologize for any inconvenience this may have caused. Please check back here for future updates.</p>\n<p>7up arizona boba calpico cappuccino caprisun chai clamato coffee coke crush crystallight culligan dietrite eggnog espresso flipside geyser gingerale hansens hi-c hiball horchata izze jolt martinellis milk monster mrpibb mug nehi nesbitt nestea ninja optimizer orangebang ovaltine pellegrino perrier punch refresco riptide rootbeer schweppes shasta silk smoothie snapple squirt stewarts sunkist tab tampico tang tea tizer tropicana yoohoo</p>\n<p>Severity: \tLow \t  \tResolved: \tNo''</p>\n<p>Severity <strong>low</strong>? Are the dreamhost systems administrators having mental problems too? This problem has persisted almost 20 hours at this point. That's bad. Unfortunately, I setup one of our new customers on this server. Big mistake.</p>\n<p>I've sent two more emails:\n''When will this be resolved?''</p>\n<p>and</p>\n<p>''And why is this problem listed as low priority on the status page??''</p>\n<p>Their response:\n''Hello,</p>\n<p>I apologize that I don't have an exact ETA to this issue. Our admins are\nstill currently working on resolving this issue at this moment. For\nfurther updates, please refer to ...''</p>\n<p>Thankfully, my sites on \"nesbitt\" are back up. However, I'm not sure they'll be that way for long. The machine was just restarted, and the load is starting to increase rapidly:\n<code>\n[nesbitt]$ w\n11:18:44 up 10 min,  2 users,  load average: 10.15, 7.51, 3.63 </code><strong></p>\n<p>Update March 25, 2007</strong>Dreamhost servers are down again. Not good. <strong></p>\n<p>Leaving dreamhost.com</strong>After much thoughtful reflection, I've decided to request a refund for my dreamhost.com payment. I wish I could stay on with them because I do like their control panel, but the outage the past few days has been unacceptable and must be accounted for.</p>\n<p>''Hello,</p>\n<p>Based on the outages over the past few days, I am cancelling my account. This email is being sent within the initial 97 days and the account was paid for via credit card, so I qualify for a refund.</p>\n<p>Even though I am emailing this refund request today, I cannot cancel right away as I am unable to access my files due to the outage. Once I am able to remove my files from your systems I will email again to confirm the cancellation, and click the close account link.''</p>","frontmatter":{"title":"Review of Dreamhost"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2007/2007-03-25-review-of-dreamhost/"}}