{"data":{"markdownRemark":{"html":"<p>Over the past couple of months, I've been working with Joomla. Its been an interesting experience, because I've run the gamut of many extensions to the core:</p>\n<ul>\n<li><strong>Components</strong> for building extensions in an MVC style framework</li>\n<li><strong>Modules</strong> for creating dynamic template extensions</li>\n<li><strong>Plugins</strong> for extending Joomla classes</li>\n</ul>\n<p>More specifically, I primarily worked on two Joomla installations, one where I ran the gamut interfacing with Joomla's core, and the other where I built a payment gateway plugin for a third-party Joomla component: <strong>Event Registration Pro</strong>.</p>\n<h2>Interfacing with Joomla's core</h2>\n<p>The Joomla component I built powers a search engine backed by MySQL. I enjoyed building it, and am planning to work on it some more to refactor the code and leverage more built-in Joomla helper functions.</p>\n<p>For instance, I'd like to make sure all the SQL queries use the Joomla query string cleaning and escaping functions, like so:</p>\n<pre class=\"sh_php\">\n$mycleanvar = $db->getEscaped($myvar, true);\n</pre>\n<p>The module I wrote acts as the front-end interface to the search engine, and its dynamic as it pulls information from the database and request parameters to make on-the-fly adjustments. I also enjoyed writing that module.</p>\n<p>The plugin I wrote hooks into the Joomla registration and authentication processes so that certain hooks are triggered depending upon on information submitted along with user registration, like bookmarking search results and registering for a newsletter.</p>\n<h2>Payment Gateway Plugins for Event Registration Pro</h2>\n<p>This was an interesting task because the Event Registration Pro payment plugin API is apparently not documented. Still, I was able to build one, and thanks to the Payment_Process PEAR library, it can connect to several different payment gateways, including Authorize.net and LinkPoint (aka YourPay, aka FirstData).</p>\n<h2>What's next?</h2>\n<p>I'm interested in digging into Drupal. I've heard many testaments that it rocks.</p>","frontmatter":{"title":"Working with Joomla Components Modules and Plugins","date":"2010-12-09T00:00:00.000Z"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2010/2010-12-09-working-with-joomla-components-modules-and-plugins/"}}