{"data":{"markdownRemark":{"html":"<p>I finally got the chance to set up a <strong>Debian Xen</strong> server today. After wrestling with Xen on a VMWare virtual machine (I know, I know) I found an older tower with an AMD CPU that happened to have the virtualization CPU capability. After that, I had much better luck.</p>\n<p>The VMWare machine actually worked out somewhat well - it did everything, except DomU networking. I tried all options: network-bridge, network-route, and network-nat - all no good - packets were blocked.</p>\n<p>With the real machine, it worked like a dream - though we did run into a problem with squeeze as a DomU (I'm running squeeze on Dom0) - when I created images with xen-create-image, the boot process would hang when trying to mount root. Lenny worked without a hitch.</p>\n<p>Next up - running an openvz kernel within a domu!</p>\n<p><strong>UPDATE</strong>: I was able to install an <strong>OpenVZ kernel inside of a Xen virtual machine image</strong> today! How freaking cool is that?? This is <em>not</em> on the VMWare machine, but a real machine with an AMD CPU that supports virtualization.</p>\n<p>The only way I could get this to work was to use the Debian Squeeze distro created with xen-create-image and without the --scsi option. The <a href=\"http://wiki.debian.org/Xen\">Debian Xen documentation</a> is a little confusing about this - whether or not to use the \"--scsi\" option. It works with Ubuntu Maverick and Lenny, but not Squeeze or Wheezy - the boot process hangs when it can't find /dev/sda2.</p>\n<p>As a workaround, I left out the \"--scsi\" flag when using xen-create-image, and then installed grub within the image (which requires a working <a href=\"http://wiki.debian.org/PyGrub\">pygrub on the debian dom0</a>). After that I was able to install the OpenVZ kernel and boot with it. See this page on <a href=\"http://superuser.com/questions/255083/xen-fails-to-boot-timeout-mounting-dev-sda2?tab=active\" rel=\"nofollow\">superuser</a> where I comment about my resolution:</p>\n<blockquote class=\"svxlb\"><pre>\nI ended up simply not using the --scsi option for squeeze guests. I was able to make changes to the domu.cfg file, referencing xvd(a|b), and installing grub in the domu as described on the Debian pygrub page. Furthermore, I was able to install openvz in the domu, too!\n</pre></blockquote>\n<p>Anyway, I am really impressed with Squeeze's support for Xen 4.0. I feel like this is going to have a huge impact on how GNU/Linux and virtualization is going to evolve. Sure, KVM is making some impressive progress into the kernel, but I'm just not comfortable with its <em>userland</em> vibe. Not to mention its spawned from <a href=\"http://bellard.org/\">Bellard's</a> qemu project - phenomenal!! As a matter of fact, some of QEMU is used for Xen's HVM implementation.</p>\n<p>I can't wait to automate the build of this server as well as the build of xen images and openvz containers within them. That will be really awesome. Oh and I also want to see what the xen http server is all about.... so much cool stuff to explore... lol!</p>","frontmatter":{"title":"Debian VMWare and Xen plus OpenVZ","date":"March 17th, 2011"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2011/03/debian-vmware-and-xen/"}}