{"data":{"markdownRemark":{"html":"<span style=\"display: inline;\">\n<p>I've been hot on the trail of getting my login and authentication worked out since I switched to awesomewm (awesome window manager) a few months ago.</p>\n<p>I chose slim as my display manager because I read it was lightweight. I was unable to get it to use libpam_ssh as the login mechanism though, so I switched to xdm.</p>\n<p>Xdm works perfectly, but it is a little rough on the eyes, so I'm doing some reading on how to jazz it up a little.</p>\n<p>But first, I want to write down my current setup, as its working pretty good for me.</p>\n<ul>\n<li>I'm using Debian Squeeze.</li>\n<li>XDM display manager.</li>\n<li>Awesome window manager - initialized by ~/.Xsession.</li>\n<li>/etc/X11/Xsession.options has \"use-ssh-agent\" removed.</li>\n<li>I <a href=\"http://live.gnome.org/GnomeKeyring/Ssh\">disabled ssh-agent in the gnome-keyring-daemon via gconf2</a> - I might try turning this back on, as I read somewhere that slim wasn't setting the SSH<em>AUTH</em>SOCK environment variable due to a d-bus communications problem.</li>\n<li>I use keychain to activate the ssh-agent that is started by XDM. Keychain is available in the debian repositories, but I mention it is from the gentoo project to be more specific.</li>\n</ul>\n<p>The only thing left I want to do is automatically <a href=\"http://live.gnome.org/GnomeKeyring/Pam\">unlock the default keyring upon login</a>.</p>\n<p><strong>UPDATE:</strong> SWEET! I finally got this setup right somehow. I think all I had to do was edit /etc/pam.d/common-auth:</p>\n<pre class=\"sh_sh\">\nauth sufficient pam_ssh.so try_first_pass\nauth    optional        pam_gnome_keyring.so\n# here are the per-package modules (the \"Primary\" block)\nauth    [success=1 default=ignore]      pam_unix.so nullok_secure\n# here's the fallback if no module succeeds\nauth    requisite                       pam_deny.so\n# prime the stack with a positive return value if there isn't one already;\n# this avoids us returning an error just because nothing sets a success code\n# since the modules above will each just jump around\nauth    required                        pam_permit.so\n# and here are more per-package modules (the \"Additional\" block)\n# end of pam-auth-update config\n</pre>\n<p>and:</p>\n<pre class=\"sh_sh\">\nsession optional        pam_gnome_keyring.so  auto_start\n# here are the per-package modules (the \"Primary\" block)\nsession [default=1]                     pam_permit.so\n# here's the fallback if no module succeeds\nsession requisite                       pam_deny.so\n# prime the stack with a positive return value if there isn't one already;\n# this avoids us returning an error just because nothing sets a success code\n# since the modules above will each just jump around\nsession required                        pam_permit.so\n# and here are more per-package modules (the \"Additional\" block)\nsession required        pam_unix.so\n# end of pam-auth-update config\nsession optional pam_ssh.so\n</pre>\n<p>Oh yes, I also read up on /usr/share/doc/libpam-ssh/README.Debian which explained how I had to create ~/.ssh/login-keys.d/ and symlink the private keys I wanted to let pam.d use to authenticate logins with.</p>\n<p>Would this work with slim now? I'm not going to worry about it for the moment!</p>\n<p>UPDATE: I almost forgot to make note of the significant effects that these changes made. I only noticed them a few days later. For some reason, xdm doesn't read /etc/profile or /etc/environment. I tried numerous ways to figure it out and finally found a suggestion to change ~/.Xsession. Here's my current file:</p>\n<pre class=\"sh_sh\">\nset -a\n. /etc/environment\nwmname LG3D\nxsetroot -cursor_name dmz\nexec awesome\n</pre>\n<p>I used to have the information in /etc/profile, but /etc/environment seems simpler for some reason. Here's what I have in /etc/environment:</p>\n<pre class=\"sh_sh\">\nall_proxy=\"http://127.0.0.1:3128/\"\nGIMP2_DIRECTORY=\"~/.config/gimp-2.6\"\n</pre>\n<p>Then of course there are all the ~/.profile, ~/.bashrc and so on files. Ugh. What a mess!</p>\n<p>From what I read, it appears that most of these configuration options are making their way into pam modules, which I think is a great idea. I read up on pam_env, but couldn't get it to work with xdm.</p>\n<p>Now back to customizing the look of the xdm greeter, as well as my desktop background.</p>","frontmatter":{"title":"XDM libpam ssh AwesomeWM gnome keyring daemon gentoo keychain nm applet Almost Perfect"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2009/2009-10-07-xdm-libpam-ssh-awesomewm-gnome-keyring-daemon-gentoo-keychain-nm-applet-almost-perfect/"}}