{"data":{"markdownRemark":{"html":"<a href=\"http://www.docunext.com/blog/2007/10/nyt-xslcache.html\">\n<p>The New York Times has released a modified xsl module for php5 which caches xsl transformations. I just built it on ubuntu and debian:</p>\n<pre>apt-get install php5-dev libxslt1-dev\nwget http://code.nytimes.com/downloads/xslcache.tar.gz\ntar -xzvf xslcache.tar.gz\nphpize./configure --with-xslcache=/usr/lib/ --with-xsl-exsl-dir=/usr/lib/\nmake\ncp modules/xslcache.so /usr/lib/php5/20060613+lfs/\ncp /etc/php5/conf.d/xsl.ini /etc/php5/conf.d/xslcache.ini\nvim /etc/php5/conf.d/xslcache.ini</pre>\n<p>Cool. I got it to work with <a href=\"http://www.nexista.org/\">nexista</a>, albeit a little funkified. It seems it can't accept a DOM Document like the regular XSLT processor class can, <a href=\"http://us3.php.net/manual/en/function.dom-domdocument-save.php\">I had to save the xsl template after it had been loaded and entities transformed</a>, and then have the XSLT object load in the file. Strange, but it worked, and I actually think this might be the right way to go - cache the xsl file with its entities converted and be done with it.</p>\n<p>This extension is actually very nice. I agree with some of their assumptions - that the XML data in an XSL transformation is likely to change, not the stylesheet. And the cache is set to expire when the modification time of the source file is changed. Very good. As I mentioned earlier, I have to use a DOM Document to convert some entities prior to the xsl transform, so I'm saving a temp file before loading it with the XSLTCache object. This requires another cache check of course.</p>\n<p>If you've been reading Docunext for awhile, I'll all about the caching. I try to cache database queries, php optcode, rendered pages, gzipped content, and even employ client caches. Why? Its by far the best performance boost available!</p>\n<p>My results? Nexista is showing up to a 25% performance increase, or in other words, a page taking 0.2 second to load only takes 0.15 seconds to load after the XSL document has been cached.</p>\n<p><a href=\"http://code.nytimes.com/projects/xslcache/wiki\">http://code.nytimes.com/projects/xslcache/wiki</a></p>\n<h4>Debian package of php5-xsltcache</h4>\n<pre>\nphp5-xsltcache\nphp5-xsltcache/DEBIAN\nphp5-xsltcache/DEBIAN/control\nphp5-xsltcache/etc\nphp5-xsltcache/etc/php5\nphp5-xsltcache/etc/php5/conf.d\nphp5-xsltcache/usr\nphp5-xsltcache/usr/lib\nphp5-xsltcache/usr/lib/php5\nphp5-xsltcache/usr/lib/php5/20060613+lfs</pre>\n<p>Control file:</p>\n<pre>\nPackage: php5-xsltcache\nVersion: 5.2.3\nSection: web\nPriority: optional\nArchitecture: i386\nDepends: php5-common (&gt;=5.2), php5-xsl\nMaintainer: Albert Lash\nDescription: PHP 5 XSLTCache Similar to php5-xslt, php5-xsltcache caches xsl documents in  permanent memory, but keeps an eye on modification time of  referenced file. See: http://code.nytimes.com/projects/xslcache</pre>\n<p>UPDATE November 1, 2007: Apache can do this stuff too! See my post on <a href=\"http://www.docunext.com/blog/2007/11/mod-transform.html\">mod_transform</a>!</p>","frontmatter":{"title":"NYT xslcache","date":"2007-10-26T00:00:00.000Z"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2007/2007-10-26-nyt-xslcache/"}}