{"data":{"markdownRemark":{"html":"<p>I'm going to send out two emails to some debian developers today. One to the maintainer of libapache2-mod-xslt, to ask that the module gets compiled without the signature, and to the maintainer of aolserver4-nsxml, to let them know that I'm doing some work on the nsxml.c code, and ask for feedback.</p>\n<p>My experience in communicating with debian developers has been good and bad. I've had a great time corresponding with <a href=\"http://etbe.coker.com.au/\">Russell Coker</a>, form Australia, who I find to be polite, intelligent, and clear, if maybe a bit verbose. Unfortunately I've also corresponded with <a href=\"http://www.docunext.com/2008/05/18/so-much-for-reaching-out/\">some who I apparently caught on a bad day</a>.</p>\n<p>Hopefully these emails go a little bit more like my correspondence with Russell!</p>\n<p>Note Bene: As awesome as Debian is, I can't really blame any DDs for being a little gruff with a groupie like me.</p>\n<h4>Email to Riccardo Setti</h4>\n<blockquote>\n<p>Hello,</p>\n<p>I'm emailing with respect to nsxml.c. I've been working on it a bit and think what I've come up with might be useful to others. Is this a package you are actively maintaining? Would you be interested in taking a look at my work?</p>\n<p>Thank you,</p>\n<p>Albert</blockquote></p>\n<p>Whoa - big surprise here! Riccardo is the same DD for libapache2-mod-xslt!</p>\n<blockquote>\n<p>Hi Riccardo,</p>\n<p>I just sent you a separate email about aolserver4-nsxml, before realizing you are also the maintainer for libapache2-mod-xslt! Sorry about the double communication.</p>\n<p>Anyway, this time I'm emailing about libapache2-modxslt. I was wondering if you would be open to packaging the module so that the module signature is omitted. I find this to be the best library out there, but the comment appended to every page makes such little sense to me I refuse to use it as packaged. I have recompiled it myself several times, but thought I would send you an email expressing my feelings.</p>\n<p>Thanks in advance for your consideration.</p>\n<p>Albert</blockquote></p>","frontmatter":{"title":"Emails to Debian Developers","date":"July 11th, 2008"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2008/07/emails-to-debian-developers/"}}