{"data":{"markdownRemark":{"html":"<p>I wanted to do some surface research about the business of open source software. In my experience, RedHat was the first public company I learned of whose focus was linux.</p>\n<p>I searched for their 2008 annual report, and was surprised to find the page hosted on a server running Cold Fusion (or at least I was led to believe this by the \".cfm\" extension)! Argh, what a disappointment. But that's besides the point.</p>\n<p>Their business model, as I understand it, is primarily based upon subscriptions. Customers subscribe to their RedHat Enterprise Linux operating system and its JBoss middleware product for updates. The subscriptions also include support services and access to subscriber-only content networks.</p>\n<p>If I understand correctly, they also earn revenue by providing global professional services to their clients.</p>\n<p>Here are some other businesses that are involved, at least to some degree, with open source software and examples of their involvement:</p>\n<ul>\n<li>Juniper - uses parts of FreeBSD in JunOS</li>\n<li>Apple - many parts of the Max OS X operating system is built from open source components</li>\n<li>Google - the Android operating system from Google uses Java and linux</li>\n<li>Nokia - uses Linux to power their Maemo handset operating system</li>\n<li>IBM - includes linux in their product and service offerings and is making significant investments into linux development, with approximately 300 full-time employees working on the linux kernel</li>\n</ul>\n<p>Other companies whose employees make contributions to the linux kernel include: Novell, Intel, Oracle and HP. Even Microsoft is getting in on the fun! In July of 2009, Microsoft made its first GPLv2 code contribution to the linux kernel!</p>\n<p>It will be interesting to see how the open source software business model evolves. To keep track of the changes, I'm starting to include <a href=\"http://www.docunext.com/wiki/Category:Technology_Companies\">technology companies</a> in the Docunext wiki.</p>","frontmatter":{"title":"The Business of Open Source Software"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2009/2009-11-08-the-business-of-open-source-software/"}}