{"data":{"markdownRemark":{"html":"<p>WSGI is pretty cool stuff - I messed around with cherrypy today, and enjoyed what I found. For a fairly small codebase its quite flexible and competent. I was reading a bunch of code from moinmoin and pycoon and took some notes...</p>\n<p>moinmoin notes:</p>\n<ul>\n<li>function description comes after \"def functionname:\"</li>\n<li>php session parser very interesting...</li>\n<li>Can you save PHP bytecodes to a file like .pyc files?</li>\n</ul>\n<pre class=\"sh_python\">\nlists = [1,2,3]\ntuples = (1,2,3)\ndictionaries = {1: \"ablh\"}\n</pre>\n<p>The colon is a great character, and python makes swell use of it.</p>\n<div>\nPrivate functions in python start with __, everything else is public. Ian of the Paste project seems to think that these type of private functions are a bad idea though.\n</div>\n<h4>CherryPy</h4>\n<p>I've been reading up on CherryPy too - <a href=\"http://www.cherrypy.org/wiki/WSGI\">this is a great read</a>. They have a page of templates and they don't trash talk xslt - good! :-)</p>\n<h4>Paste</h4>\n<p>I haven't actually tried out Paste yet, but the docs are very good. They explain a lot of what WSGI applications are all about. I read up on the WSGI spec too.</p>\n<p>That leads me to another thought - I need to get more comfortable with how the python libraries and packages are installed. I may be wrong, but it feels like the packaging and path setup for python is a little haphazard.</p>\n<h4>PHP versus python</h4>\n<p>Just some comparison notes...</p>\n<ul>\n<li>PHP's \"this\" is like python's \"self\"</li>\n<li>PHP's constructor class functions/methods are like python's <strong>init</strong> class functions/methods* both languages are down with the idea of camelCaseForMethodNames</li>\n</ul>\n<p>PHP foreach:</p>\n<pre class=\"sh_php\">$blah = array(\"a\",\"b\",\"c\");\nforeach ($blah as $barf){\n     echo $barf;\n}</pre>\n<p>Python for:</p>\n<pre class=\"sh_python\">\nblah = [\"a\",\"b\",\"c\"]\nfor barf in blah:\n    print barf\n</pre>\n<p>My personal opinions:</p>\n<ul>\n<li>I like the dot syntax of python for referencing objects and methods, reminds me of javascript and actionscript</li>\n<li>Lists, tuples, and dictionaries still confuse me a little, but I'm figuring it out</li>\n<li>For some strange reason I feel more comfortable with <strong>self</strong> than <strong>this</strong></li>\n</ul>","frontmatter":{"title":"More Python WSGI moinmoin and pycoon Notes"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2007/2007-12-29-more-python-wsgi-notes/"}}