{"data":{"markdownRemark":{"html":"<p><strong>Redis</strong> and <strong>Tokyo Tyrant</strong> are the last servers I'm trying out as I explore document-based storage systems, aka NoSQL.</p>\n<h4>Redis</h4>\n<p>I had tried Redis once before, but for some reason I didn't keep testing it out. I seem to think I had some problems setting up the server or the Ruby gem I was trying to use. Whatever the issue was, its no longer apparent, and I was able to get up and running right away!\nBased on my limited experience with Redis so far, it seems a lot like memcachedb, but with some additional native data types (in addition to strings):</p>\n<ul>\n<li>lists</li>\n<li>sets</li>\n<li>increment / decrement counters</li>\n</ul>\n<p>Memcachedb can of course do this too with a bit of serialization / marshaling. As such, even though those data types are supported, it might be better to use an abstraction layer interface between the data store and program logic, so if for some reason it makes sense to switch between redis and memcachedb or vice-versa, it won't require a massive recode.</p>\n<h4>Tokyo Tyrant</h4>\n<p>I'd heard of <a href=\"http://1978th.net/tokyocabinet/\">Tokyo Cabinet</a> (the storage file format behind <a href=\"http://1978th.net/tokyotyrant/\">Tokyo Tyrant</a>, the network interface) before, but at the time it was fairly new and not widely available. Its now available on Debian, which is awesome because its just about as awesome as Daniel J. Bernstein's CDB file format in terms of speed and efficiency. I'd even hoped for a network interface to CDB!</p>\n<p>Unfortunately Tokyo Tyrant is still in Debian \"Sid\", the unstable repositories, but still that's a very good sign of things to come.</p>\n<p>I didn't realize this before, but Tokyo Tyrant supports the memcached protocol. That is a <strong>huge</strong> benefit in my opinion, but as it turns out, there are many really awesome benefits to Tokyo Tyrant:</p>\n<ul>\n<li>The server can embed Lua</li>\n<li>A RESTful interface for access over plain old HTTP</li>\n<li>Replication</li>\n</ul>\n<h2>Docunext Wiki Pages</h2>\n<ul>\n<li><a href=\"http://www.docunext.com/wiki/Tokyo_Tyrant\">Tokyo Tyrant</a></li>\n<li><a href=\"http://www.docunext.com/wiki/Redis\">Redis</a></li>\n</ul>\n<h2>External Links</h2>\n<ul>\n<li><a href=\"http://timyang.net/data/mcdb-tt-redis/\">MemcacheDB, Tokyo Tyrant, Redis performance test</a></li>\n</ul>","frontmatter":{"title":"Redis and Tokyo Tyrant","date":"February 27th, 2010"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2010/02/redis-and-tokyo-tyrant/"}}