{"data":{"markdownRemark":{"html":"<h4><b>VMWare Fusion</b></h4>\n<p>I was right about VMWare on Mac OS X - they are going to charge for it.  Its actually not a bad price though, $79 or $39 if you pre-order.</p>\n<p>The nice thing about VMWare Fusion for Mac OS X is that they have all sorts of other products that can work with it. I believe they also use an open format for their disk images.</p>\n<h4><b>Parallels</b></h4>\n<p>These factors make VMWare a compelling alternative to Parallels, which has worked very well for me, but due to its proprietary disk format, it losing its luster.</p>\n<h4><b>QEMU, KQEMU, and \"Q\"</b></h4>\n<p>My favorite of all these virtualization systems is QEMU. It is open source, runs on a wide variety of platforms (even FreeBSD!), and offers a wide range of processors to emulate. The main problem I have with it right now is that the kqemu kernel module has not yet been ported to Mac OS X. I've considered running ubuntu in a VMWare or Parallels vm, and then trying to run kqemu inside of that, but that's just crazy talk.</p>\n<p>What would be optimal would be to run VMWare Fusion on Mac OS X, and run QEMU w/ KQEMU on everything else. However, while it is possible to convert VMWare .vmdk's to qcows, QEMU and VMWare cannot run both types of files (AFAIK).</p>\n<p>So what to do? My gut is telling me that since KQEMU is now GPL, it will   likely get ported to Mac OS X at some point in the near future. As it stands, running Q on Mac OS X without hardware acceleration isn't terrible. My gut is also telling me that the vde package which QEMU can work with is really awesome. I think it is even available on Mac OS X via MacPorts.</p>\n<p>I may end up purchasing an advance copy of VMWare Fusion just so for the convenience factor, but going forward I'm planning to use QEMU.</p>\n<p>¥</p>","frontmatter":{"title":"VMWare vs. Parallels vs. QEMU","date":"June 28th, 2007"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2007/06/vmware-vs-parallels-vs-qemu/"}}