{"data":{"markdownRemark":{"html":"<p>In the past few years, there's been some exciting news in the world of cryptography. As mentioned in our post about the <a href=\"http://www.docunext.com/blog/2007/09/via-padlock.html\">VIA padlock, the use of the padlock as an engine for OpenSSL yields some very impressive results</a>.</p>\n<p>Then last night I realized that the AMD Geode LX800 (the same chip used in the new <a href=\"http://www.docunext.com/blog/2007/07/alix.html\">PC Engines ALIX boards which I've been blogging about</a>) also has a hardware random number generator (RNG) as well as a built in AES Security Block engine. That is really cool!</p>\n<p>Riding on the excitement that the AMD Geode LX800 has these great new features, I did some serious diggin' in the net and found some even more cool stuff! :-)</p>\n<p>Among the finds:</p>\n<ul>\n<li><a href=\"http://www.openbsd.org/cgi-bin/man.cgi?query=glxsb&sektion=4&arch=i386\">glxsb(4) - Geode LX Security Block crypto accelerator for OpenBSD</a></li>\n<li>Linux CryptoAPI now includes support for using the Geode LX Security block for its AES engine (as of 2.6.20?):</li>\n</ul>\n<pre>\n59           Say 'Y' here to use the AMD Geode LX processor on-board AES\n60           engine for the CryptoAPI AES algorithm.\n61\n62           To compile this driver as a module, choose M here: the module\n63           will be called geode-aes.</pre>\n<p>So that got me wanting to test it out, but the linux CryptoAPI is low-level, and doesn't have many userland tools, like OpenSSL, and OpenSSL doesn't have an engine driver for it, nor am I aware of a way to get OpenSSL to use the CryptoAPI instead of its internal algorithms.</p>\n<p>So I did some more research, and found information on <a href=\"http://ocf-linux.sourceforge.net/\">how to get OpenSSL to use the linux CryptoAPI as its engine</a>.</p>\n<p>Here's information on how to get <a href=\"http://www.docunext.com/wiki/My_Notes_on_Patching_2.6.22_with_OCF\">your linux kernel patched with the ocf crypto device, especially good for use with AMD Geode lx800 processors</a>.</p>\n<h4>What processors to use where</h4>\n<p>At this point in time, to design some heavy duty infrastructure, I would use the following chips in the following ways:</p>\n<ul>\n<li><strong>AMD Geode LX800</strong> - firewalls / ipsec vpn / layer 4 load balancer nodes because of aes security block and low power, no fan, perfect for stable embedded devices</li>\n<li><strong>Via C7</strong> - SSL offloaders / front line web servers / layer 7 load balancers - easy integration with openSSL for \"<a href=\"http://www.logix.cz/michal/doc/article.xp/padlock-en\">wicked fast encryption</a>\" (Michal Ludvig is from the Czech Republic but his use of \"wicked\" suggests he's from New England... interesting.) - the C7 has great power utilization and can handle a decent amount of RAM (about 2GB I think), very small CPU cache though so not appropriate for directly interacting with storage facilities</li>\n<li><strong>Intel Celeron</strong> - A relatively low powered and low-cost cpu which has access to some great motherboards (some with on board gigE) and high amounts of RAM (up to 8GB I believe, at least 4BG). No encryption acceleration or hardware random number generator limits the flexibility of the chip though.</li>\n</ul>\n<p>Because the AMD Geode and Via C7 chips are so low power and security centric, they are my choice for high-availability failover perimeter systems. Behind them, the intel celeron and at least one corresponding motherboard can handle sleep states very well in linux, and could potentially be used to setup an energy efficient, scalable load-balance farm. When demand is high, they wake, bake, and serve, and when demand is low, they nap. Sounds good, right?</p>\n<p><a href=\"http://www.docunext.com/wiki/PfSense_test_results_of_the_padlock_kernel_driver_on_a_VIA_C7\">PfSense test results of the padlock kernel driver on a VIA C7</a></p>","frontmatter":{"title":"2006 2007 Cryptography News","date":"September 10th, 2007"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2007/2007-09-10-2006-2007-cryptography-news/"}}