{"data":{"markdownRemark":{"html":"<p>Ah, the term modular. It has many different meanings in many different contexts, but in general it suggests flexibility, interoperability, and a certain amount of <em>buildability</em>.</p>\n<p><strong>Drupal</strong> uses the term \"module\" to refer to additional \"packages\" of code which can enhance, extend, or customize its functionality. It uses the term very well!</p>\n<p>A co-worker of mine described Drupal along these lines: \"Drupal is its modules\". That simple phrase says a lot.</p>\n<p>The modularity of Drupal proves its value and worth to me by the fact that so many modules are able to run concurrently with one another. I currently have about seven or eight modules running on an installation I am setting up and I have not perceived ANY incompatibilities.</p>\n<p>Another co-worker of mine described Joomla! along these lines: \"Joomla works fine with one large component, functionally with two large components, but starts to break down with three or more large components.\"</p>\n<p>While that's somewhat besides the point for this article, I recently wrote an <a href=\"http://www.docunext.com/2010/09/joomla-versus-drupal-and-wordpress/\">article comparing Joomla, Drupal and Wordpress</a>, referencing Debian's policy towards the three content management systems. In the article I stated how much I value the opinion of the Debian community, and I have to echo that sentiment in this post. (Also, don't mistake this as a diss to Joomla, I've worked a bunch with it and found the experience quite satisfactory.)</p>\n<p>More specifically, I reference the <strong>dh-make-drupal</strong> package that is available in the Debian Squeeze repository. What is the dh-make-drupal package? Let's find out:</p>\n<pre class=\"sh_sh\">\n\nlash@pro-2-gl:/var/www/var/lib/drupal6/modules$ apt-cache show dh-make-drupal\nPackage: dh-make-drupal\nPriority: extra\nSection: web\nInstalled-Size: 96\nMaintainer: Gunnar Wolf <gwolf@debian.org>\nArchitecture: all\nVersion: 0.6-2\nDepends: ruby, libruby, libcommandline-ruby, libhpricot-ruby, debhelper (>= 5), build-essential\nSuggests: drupal6 | drupal5\nFilename: pool/main/d/dh-make-drupal/dh-make-drupal_0.6-2_all.deb\nSize: 19108\nMD5sum: 92539d5b7da069cac913485dc81812c9\nSHA1: 7778cd034013dd419da9aa1ee0d02d8facda820d\nSHA256: 877c8bc8c2f8ad6a1aa4793dfd0b37c8c76cba2ac97909ed39601707437ceaf3\nDescription: Create Debian packages from Drupal modules and themes\n The purpose of this program is to generate Debian packages for any Drupal\n projects (that is, modules or themes).\n .\n Given that Drupal developers publish their work through the main Drupal\n site (http://drupal.org), this program fetches the information for the\n latest available versions (for the right Drupal release, and with the\n specified stability level), and prepares a Debian package from it.\nHomepage: http://www.github.com/gwolf/dh-make-drupal\n</pre>\n<p>That is very awesome, because right now there aren't that many drupal modules available:</p>\n<pre class=\"sh_sh\">\ndrupal6-mod-i18n - i18n module for Drupal 6\ndrupal6-mod-inline - inline module for Drupal 6\ndrupal6-mod-ldap-integration - ldap_integration module for Drupal 6\ndrupal6-mod-masquerade - masquerade module for Drupal 6\ndrupal6-thm-arthemia - arthemia theme for Drupal 6\ndrupal6-trans-ru - Russian translation for Drupal 6\n</pre>\n<p>And compared to using apt-get, manually installing drupal modules is an inefficient process.</p>\n<p>Given that drupal7 is going to include some of the more widely popular modules like CCK and views, it would be really terrific if a core set of drupal modules got packaged together, like \"movabletype-plugin-core - Core Movable Type plugins\".</p>\n<p>Even more modules I'm using:</p>\n<ul>\n<li>Chaos Tools</li>\n<li>Data</li>\n<li>Schema</li>\n<li>Advanced Help</li>\n</ul>","frontmatter":{"title":"Drupal IS Its Modules and Drupal Packaging on Debian","date":"December 18th, 2010"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2010/12/drupal-is-its-modules/"}}