{"data":{"markdownRemark":{"html":"<p>Recycling remains a topic of debate for many. Is it worth the extra effort and cost? Does it hurt the environment more than disposal?</p>\n<p>With respect to the latter question, I'm still on the fence. Does the extra fuel and energy required to recycle something hurt the environment more than preventing something from going into a landfill? Its a complicated question, and is present in more debates than we might think - like the diaper debate. Which is better for the environment - disposable or cloth diapers? I used to think cloth diapers until I factored in the energy and water required to clean cloth diapers.</p>\n<p>And what about disposable chop sticks? Apparently there are a large amount of disposable chop sticks consumed everyday. Of course there are reusable chop sticks, but they must be cleansed well enough to eat with. Again, I don't know the answer to this complex question.</p>\n<p>But, I still do recycle. I believe that there are several things which are easy to recycle in practice and in process:</p>\n<ul><li>Paper</li><li>Glass</li><li>Plastic</li><li>Metal</li></ul>Especially when it comes to metal containers which have redemption values. I grew up in <a href=\"http://www.boston-notes.com/\">Massachusetts</a> and as a child I would collect cans to save money and buy toys. When I recently moved to <a href=\"http://www.bethesda-notes.com/\">Bethesda, Maryland</a>, I was dumbfounded to learn that soft drink cans do not have a redemption value here. Yes, many people recycle their cans for no value, but the added bonus of redemption values is that underprivileged and / or homeless people can collect discarded items for a small revenue stream. They can eek out an existence and help clean up the neighborhood. Don't get me wrong, that's obviously not a desirable situation and not one to aim for or take advantage of, but it is a reality.\n<p>In many cities across the United States, it is common practice for the homeless to collect metal for scrap recycling. In fact, the only real way to create any effective waste reduction movement is to expand upon deposit and redemption programs. Americans, while we're apparently not the most fiscally responsible, are hyper-aware of money and seem to always get in motion when its is involved.</p>\n<p>Lastly, I want to share some thoughts about reusing. Reusing is easy and can extend the life and purpose of something before it is discarded. Boxes, bags, and other containers can be used to do many more beneficial things before going to their final, or extended resting place. For example, I often use smaller plastic bags to put banana peels or similar in before putting them into my trash. It helps to prevent my trash from smelling too strong!</p>\n<p>On the flip side, I've made the mistake of putting too much effort into reusing making it a wasteful endeavor. Other easy suggestions on items to reuse are very welcome!!!</p>","frontmatter":{"title":"Reuse Redemption Values and Recycling","date":"2009-07-23T00:00:00.000Z"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2009/2009-07-23-reuse-redemption-values-and-recycling/"}}