{"data":{"markdownRemark":{"html":"<p>OK, I'm getting a little impatient with the Free Software Foundation's work on the GPLv3 and the AGPLv2. <a href=\"http://www.funambol.com/blog/capo/2007/04/asp-loophole-what-if-fsf-got-it-right.html\">This post is what's getting me all fired up</a>. It expresses quite well my feelings about the GPLv3, the Affero GPL, and the Affero GPLv2, as well as how all those relate to software as a service.</p>\n<p>The author makes a great point that many software developers won't use the GPLv3 to develop web applications because of the fact that the \"spirit of the GPL\" is lost due to the technical constraints of software distribution and web applications. In  a nutshell, you only have to publish and license modifications to GPL software under the GPL if you distribute the original software in any way.  Thanks to the magic of the internet, you can easily reap the benefits of GPL software without every distributing it. I'm not saying that is wrong, I'm just saying that it circumvents the purpose of the GPL, rendering it useless to web applications. At this point, open source web applications have the option of licensing under very liberal licenses like the MIT License, or a proprietary license.</p>\n<p>The AGPL attempts to fix this with their clause about public access to the software rendered as a service, or something like that. However, the author of the above mentioned blog post makes some very good points:</p>\n<ul>\n<li>The Affero GPL is branded, what's up with that??</li>\n<li>The Affero GPL is not compatible with the GPLv2, but it is possible that the AGPLv2 is compatible with the GPLv3.</li>\n<li>The AGPL is not OSI approved - that is actually very important!</li>\n</ul>\n<p>Again, all this has to do with one post by Brett at the FSF. Its a tantalizing post for sure, but leaves out too many details to be useful. Here is <a href=\"http://www.fsf.org/blogs/licensing/2007-03-29-gplv3-saas\">Brett's post about GPLv3 and Software as a Service</a>.</p>\n<p>UPDATE: A day after writing this and the chance to read this article: <a href=\"http://www.informationweek.com/showArticle.jhtml?articleID=199703098\" rel=\"nofollow\">Novell Says Open Source License Changes Could Kill Microsoft Deal</a>, I understand that the FSF has much bigger fish to fry than the SaaS loophole.</p>\n<p>See also: <a href=\"http://www.informedlicensing.com/\">Informed Licensing</a></p>","frontmatter":{"title":"GPLv3 Rant","date":"May 29th, 2007"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2007/05/fsf-rant/"}}