{"data":{"markdownRemark":{"html":"<p>I've been trying to install some freeware on my tibook, and for whatever reason I keep running into these odd road blocks. On my previous laptop I was able to install gimp, and neoOffice, with no problems, and run the programs with ease.</p>\n<p>This laptop is not as cooperative. i download the drivers for neoOffice, and install them with no difficulty, but when I go to run the program the icon simply bounces up and down and the program is completely unresponsive. I changed the version of neoOffice I'm trying to install. My hope is there was simply an error with the version I was trying to use.</p>\n<p>I'm now installing the 2.2.3 version of neoOffice but it keeps stopping at the same place. I'm going to install an older version that I know runs on another machine I use. hopefully this one will work.</p>\n<p>Ok I checked the <a href=\"http://neowiki.neooffice.org/index.php/Troubleshooting_Tips#Check_for_an_up-to-date_Java_version\" rel=\"nofollow\">neowiki how</a>. i have to install the most up to date version of java. Now rebooting, let's see if this works.</p>\n<p>Victory! That was the problem, I didn't have the most up to date version of Java. so sometimes it's worth staying up to date on the latest software updates.</p>\n<p>As for gimp, I run the install process, and it tells me I have to install x11 from the install CD. i thought I could just download it from the internets, rather than put the cd in. What a bone head I am, apparently it has to be installed from the install cd. Don't ask me why, but it is particular like that.the following link worked for me to <a href=\"http://sourceforge.net/project/downloading.php?groupname=gimp-app&amp;filename=Gimp-2.2.11.dmg&amp;use_mirror=internap\" rel=\"nofollow\">download Gimp</a>. Once I had the correct version of X11 installed everything went very smoothly.</p>\n<p>¥</p>","frontmatter":{"title":"Free and Open Source Software on my Titanium Powerbook"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2008/2008-03-21-freeware-on-my-tibook/"}}