{"data":{"markdownRemark":{"html":"<p>I'm always trying to look ahead when it comes to technology - things move so fast, I feel like I have to. So what do I see on the horizon as far as technology standards go? I thought you'd never ask!</p>\n<p><strong>XTHML</strong></p>\n<p>I'm a huge fan of XML, so I'm pleased to see XHTML coming to life. The transitional DTD is going to be a crutch for many (myself included), but I hope to make the jump to 1.1 strict very soon. In preparation, I need to get my hands on the official <a href=\"http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd\">DTD</a> so I can force myself to validate every page automatically without having to manually use the <a href=\"http://validator.w3.org/\">W3C markup validator</a>.</p>\n<p><strong>SVG</strong></p>\n<p>SVG stands for scalable vector graphics and its XML based as well, so I'm a pretty big fan of it. However, its not as commonly integrated as I'd like. Inkscape brings it a huge step forward and Iceweasel (Firefox) has no problem rendering it, but as far as non-browser based graphics goes, ghostscript is the heavy hitter when it comes to vector graphics standards.</p>\n<p><strong>Canvas</strong></p>\n<p>Canvas is a nice graphics rendering system for browsers, but its not yet a standard. I read somewhere that Apple has some patents covering the technology, but then I <a href=\"http://en.wikipedia.org/wiki/Canvas_(HTML_element)#Intellectual_property_over_canvas\">read that if the W3C adopts canvas as a standard, they will openly license the patents</a>.</p>\n<p><strong>SWF</strong></p>\n<p>For multimedia on the web, most people use Shockwave Flash (swf). Its not an open standard, but the format specification has been publicly available for several years, and there are many open source tools which can generate swf files, like ming (which I've had great experiences with by the way - it works really well!).</p>\n<p>Adobe has launched the Open Screen Project, but as far as I can tell, it hasn't made any difference in the role of SWF and FLV. For viewing SWFs on open operating systems, there are at least two options: Gnash and Adobe's Flash Player 10.</p>\n<p><strong>SMIL</strong></p>\n<p>Although a standard that has been around for a long time, I don't know of any examples to share or view myself. All I know is that its supposed to be a streaming multimedia standard, but I have my doubts that it will ever really come to life.</p>\n<p><strong>OOXML</strong></p>\n<p>Open Office XML, as the name suggests, is also based on XML. Therefore, its easy to generate these documents from any data source with XSLT. I've started some work with <a href=\"http://www.docunext.com/blog/2009/02/14/open-document-spreadsheet-format/\">Open Document Speadsheets</a> and I'm definitely going to do more.</p>\n<p><strong>PNG</strong></p>\n<p>Portable Network Graphics - actually quite a nice format. Not compatible with Internet Explorer 6 though.</p>\n<p>I also want to mention here that it seems to me that Microsoft's Internet Explorer hinders these great standards from being more broadly adopted - it does not support application/xhtml+xml mime types, nor SVG. Too bad!</p>","frontmatter":{"title":"The State of Standards"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2009/2009-03-04-the-state-of-standards/"}}