{"data":{"markdownRemark":{"html":"<p>I've decided that the Thecus n2100 is not worth the effort. While I had fun and learned a lot in setting up Debian on it, it has consumed a lot of time. In my humble opinion, the device does not perform well enough to merit its expense as a NAS.</p>\n<p>If I were to do it over again, I would instead choose the Buffalo Linkstation Pro, which has an aggressive price (around $170), includes a drive, outperforms the Thecus, and is smaller. The Linkstation Pro also runs Debian!</p>\n<p>The Thecus n2100 costs $290 without a drive! Considering I just bought a <a href=\"http://mytechdeals.blogspot.com/2007/02/refurbished-everex-laptops-at-walmart.html\">\nnotebook with 512mb of ram, a 60gb hd, and a much more powerful processor from Walmart for $108 more ($398)</a>\n, its ludicrious to pay that amount for the Thecus. Thankfully, my Thecus at least came with a 256MB ram chip i can re-use as well as taught me a little about serial connections.</p>\n<p><b>Lingering Questions</b></p>\n<p>Is there a quality NAS that has a reliable serial connection? While I'm very glad that the Thecus n2100 had a serial connection, it was really difficult to access, requiring the removal and replacement of the hard drive chassis. According to this page on <a href=\"http://david.thg.se/n2100/addserial.html\">\nadding a serial connection to the Thecus n2100</a>\n, the later boards don't even come with the pin-outs! What's worse, I could not get a consistent read on the serial connection from the Thecus. I tried a real null modem db9 serial cable, but since it didn't work, I ended up using\n<a href=\"http://www.docunext.com/blog/2007/02/more-thecus-n2100-pics.html\">simple wires to make the serial connection to the Thecus</a>.</p>\n<p>The Buffalo Linkstation doesn't have a built-in standard serial pinout, nor does the NSLU2. Do any of these work with a USB2Serial adapter? Not likely. <b>\nAlternatives</b></p>\n<p>Instead of a Thecus n2100, why not buy a Shuttle PC? This link to newegg.com offers a barebones for $179, plus $75 for a processor, and you've got yourself a MUCH more powerful machine than a Thecus n2100, for a cheaper price!</p>\n<p>I'm actually thinking of building a high performance RAID0 NAS out of one of these. I'd get another nic card (four port would be good), ram, and a dual core processor. For a few dollars more than a Thecus, this machine would scream. Question: how much energy would this consume?</p>","frontmatter":{"title":"Giving up on the Thecus n2100","date":"February 28th, 2007"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2007/02/giving-up-on-the-thecus-n2100/"}}