{"data":{"markdownRemark":{"html":"<p>Being a fan of Apache, I've read the mod<em>rewrite guide a few times. Its very cool stuff, and allows you to do almost anything you want with URLs. If you've interacted with the rewriting capabilities of mod</em>rewrite, you know its raw power, and sometimes its capacity is overkill, and something more flexible is required.</p>\n<p>Therein lies the concept of url routing. I'm not a fan of that name at all. Routing to me means defining connections between separate networks, but the name has stuck.</p>\n<h4><b>Frameworks that use Routing</b></h4>\nRuby on Rails and Symfony are two that I'm aware of, and I'm sure that there are many more. What I do like about the way they manage the routing specifications - in a configuration file. Symfony uses YAML, and while I prefer XML, the idea is the similar enough to give me a sense of like-mindedness.\n<h4><b>Downfalls of Routing</b></h4>\nSometimes routing can actually obfuscate what's going on, that's why a lot of times I like to keep the url as the default query string parameters that are used by browsers and web servers by default on private applications.\n<h4><b>Benefits of Routing</b></h4>\nHowever, when it comes to public resources, the url can serve as another preview for users to see before visiting a website.\n<h4><b>Routing with XSL</b></h4>\nXSL isn't really designed for routing as far as I can tell, but it is possible to integrate a routing process into an XSL framework, like <a href=\"http://www.nexista.org/blog/\">Nexista</a>.\n<p><a href=\"http://www.symfony-project.org/book/1_0/09-Links-and-the-Routing-System\">http://www.symfony-project.org/book/1_0/09-Links-and-the-Routing-System</a></p>\n<p><a href=\"http://api.rubyonrails.org/classes/ActionController/Routing.html\">http://api.rubyonrails.org/classes/ActionController/Routing.html</a>\n<a href=\"http://wiki.rubyonrails.org/rails/pages/Routes\">http://wiki.rubyonrails.org/rails/pages/Routes</a>\n<a href=\"http://manuals.rubyonrails.com/read/chapter/65\">http://manuals.rubyonrails.com/read/chapter/65</a></p>\n<p>¥</p>","frontmatter":{"title":"URL Rewriting and Routing with XSL","date":"May 24th, 2008"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2008/2008-05-24-url-rewriting-and-routing-with-xsl/"}}