{"data":{"markdownRemark":{"html":"<p>I'm re-contemplating my comprehension of error handling in computer programming.</p>\n<p>Like testing, error management is sometimes relegated to a post-programming task. And likewise for both, I see more and more Ruby developers engage in testing and error management at the <em>beginning</em> of a project. While I plan to do more thinking and writing about testing, this post will only be about error management.</p>\n<h4>Example Error Handing in Ruby</h4>\n<p>Let's take an example. Here's an excerpt of code which shows how Ruby can handle an error:</p>\n<pre class=\"sh_ruby\">\nbegin\n    barf &lt;&lt; \"yo\"\nrescue => e\n    puts e.to_s\nend\n</pre>\n<p>When I try and run that code in irb1.9.1, this is the result:</p>\n<pre>undefined local variable or method `barf' for main:Object</pre>\n<p>If I try running just:</p>\n<pre class=\"sh_ruby\">barf &lt;&lt; \"yo\"</pre>\n<p>This is the result:</p>\n<pre>\nNameError: undefined local variable or method `barf' for main:Object\n\tfrom (irb):6\n\tfrom /usr/bin/irb1.9.1:12:in `&lt;main>'\n</pre>\n<p>Still with me? None of this is very exciting, but it may help some readers.</p>\n<p>How about something more interesting? Even Ruby-ish? Well I've been noticing that some Ruby developers are treating errors as likely situations which can help initiate further steps to produce desirable results, rather than situations that should be avoided or should not happen.</p>\n<p>In fact, I really like that the base class is named \"Exception\". It reminds me of the \"unless\" operator, as opposed to the \"if\" operator. I'm not sure, but there may even be some efficiency going on here. Even if there isn't, I still ike the idea of viewing a logical statement as saying, this is going to happen almost all of the time, except in certain circumstances. In those circumstances, do something special.</p>\n<h4>A Really Good Ruby Exception Example</h4>\n<p>Let's take a look at git-wiki.rb, shall we?</p>\n<p>These few lines say a lot:</p>\n<pre class=\"sh_ruby\">\n    def self.find(name)\n      page_blob = find_blob(name)\n      raise PageNotFound.new(name) unless page_blob\n      new(page_blob)\n    end\n    def self.find_or_create(name)\n      find(name)\n    rescue PageNotFound\n      new(create_blob_for(name))\n    end\n</pre>\n<p>Here's how I see this might flow:</p>\n<ol>\n<li>The method \"find or create\" is called with a name</li>\n<li>It immediately calls find</li>\n<li>The find method will either finish successfully or raise an PageNotFound error</li>\n</ol>\n<p>There are many other ways to achieve this same control structure, what makes this one better?</p>\n<p>When I first came upon this, I didn't grasp its power because its so simple. The \"find or create\" method is nothing more than an interface to the find or new methods. I have to think it is faster to assume that the page exists instead of checking for it, and then finding it. But what if we are wrong?</p>\n<p>Again, rather than testing for the existence of the page each time it is requested, we can setup a listener for the less-likely case of when there isn't one, and send it signals when those cases occur. I find this to be a very clean and elegant way!</p>\n<p>Rather than having to keep track of every little thing that is happening in the control structure, listeners and signals can modify the control structure on a grander scale, with less effort and I would expect greater efficiency.</p>\n<h4>Do You Know The Internals?</h4>\n<p>I'm curious if whether this type of control structure is more efficient than using if/then statements to check for success or failure or certain functions. I'll try and setup a benchmark comparison, but until then, if you know anything about this topic, please share!</p>\n<p><strong>UPDATE</strong>: After writing this blog entry post, I re-factored <a href=\"http://www.docunext.com/\">Rack-XSLView</a>. The change was substantial and in my humble opinion, a major improvement.</p>","frontmatter":{"title":"Ruby s Exception Class aka Error Handling and Management","date":"March 20th, 2010"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2010/03/rubys-exception-class-aka-error-handling-and-management/"}}