{"data":{"markdownRemark":{"html":"<p>Do you fear the idea of no one watching your every move?</p>\n<p>Why anyone would use Foursquare is beyond me. When I'm away from home, the only people I want to know where I am include my immediate family and the person watching my house.</p>\n<p>Isn't it all too obvious that a house is easier to rob if the owner is away in a foreign country? And isn't it easier for would-be robbers to lie to the police and say that they are actually friends with the owner, who said it was fine for them to borrow their blue-ray disc player for an upcoming Superbowl party, and the diamond necklace for an upcoming fundraiser?</p>\n<p>Oh people, come on? Let's have some quality conversations with our parents, siblings, children, friends, neighbors, and even salespeople and cashiers while shopping. Maybe then we won't be so needy for the desperately extreme types of un-worldly connections we can get through the fringes on online social networking.</p>\n<h4>So why has Facebook created \"Places\"?</h4>\n<p>And who was the marketing genius who came up with the \"Places\" moniker? Did they also come up with the creative \"Windows\" term for Microsoft. As it turned out, Windows as a term is so generic a federal judge threatened to void their trademark in their lawsuit of infringement against \"Lindows\". The case was subsequently dropped, resulting in <a href=\"http://www.docunext.com/wiki/Lindows\">Microsoft paying out the nose to Lindows to get them to change their name to Linspire</a>.</p>\n<p>My answer is... I have no idea. Facebook, like Google, is something of a one-trick pony, struggling to do more. Google has definitely succeeded with some minor successes, like <a href=\"http://www.docunext.com/blog/gmail/\">GMail</a> and their domain services, but still falters from time to time, as seen with their surprise announcement that of <a href=\"http://www.soggyblogger.com/blog/2010/08/wave-goodbye.html\">Google Wave has closed</a>.</p>\n<p>I've heard rumors that smoking too much marijuana could lead to paranoia. Perhaps, if psychiatrists come to recognize reverse paranoia as a psychological issue, could prescribe marijuana to those suffering from it. Perhaps we'll see Facebook and Foursquare <a href=\"http://www.informedlobbying.com/\">lobbying</a> against it in <a href=\"http://www.dc-notes.com/\">Washington DC</a>!!</p>\n<h2>Facebook Account Unavailable?</h2>\n<p>After I published this post, I tried to log into Facebook to \"share\" it, but only got this far:</p>\n<p>I tried logging in again and some javascript loop must have gone haywire because my computer became unresponsive and I had to reboot. Doh! Now it seems to be back operational...</p>","frontmatter":{"title":"Facebook Places and Reverse Paranoia"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2010/2010-08-19-facebook-places/"}}