{"data":{"markdownRemark":{"html":"<p>I've heard complaints about tools like <tt>nmap</tt> stating that they cause problems because they can be used to identify security holes, and thus contributes to nefarious causes. I totally disagree. True, it can definitely be used to identify security holes, it is certainly not designed to take advantage of them.</p>\n<p>While nmap is self-described as a \"Free Security Scanner For Network Exploration &#x26; Security Audits\", I feel its strength is in its exploration and reporting capacities.</p>\n<p>Compare that to the \"Havij\" tool. Havij is described as :an automated SQL Injection tool that helps penetration testers to find and exploit SQL Injection vulnerabilities on a web page\".</p>\n<p>I have never used havij, but I have defended against its use, and I even take issue with its description. While it sounds benevolent to state that is \"helps penetration testers\", there is really no good reason for it to \"exploit SQL injection vulnerabilities\". Yes, there is a big difference between <em>finding</em> and <em>exploiting</em>. What's worse, SQL injection exploitation can cause <strong>serious</strong> problems. Yikes!</p>\n<p>Thankfully the creators of Havij set the software to include its name as the user-agent HTTP header. That makes it much easier to defend against, though presumably it would not be too difficult to alter the user-agent to mimic Firefox or Internet Explorer.</p>\n<p>In my experience with Havij, I needed to defend against it because its automated usage was effectively causing a denial-of-service. All it took was a simple Apache access control configuration, like so:</p>\n<pre class=\"sh_xml\">\nSetEnvIf User-Agent Havij badbot\n&lt;Directory /docroot>\nOrder Allow,Deny\nAllow from all\nDeny from env=badbot\n&lt;/Directory>\n</pre>\n<p>I can't remember if the user-agent string is case-sensitive, but I'm guessing it is.</p>\n<p>See also:</p>\n<ul>\n<li><a href=\"http://httpd.apache.org/docs/2.2/mod/mod_authz_host.html\">Apache2 mod_authz_host</a></li>\n</ul>","frontmatter":{"title":"Security Analysis Tools nmap versus havij","date":"December 24th, 2010"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2010/2010-12-24-security-analysis-tools-nmap-versus-havij/"}}