{"data":{"markdownRemark":{"html":"<p>As luck would have it, I decided today that I wanted to switch from using the <tt>fgrlx</tt> proprietary ATI video graphics driver to the preferable open source driver <tt>radeon</tt>.</p>\n<p>Like most of the luck I've had, it was not without a challenge - or with surprises!</p>\n<p>When I switched video drivers, my <strong>X11 screen was fuzzy</strong>. After some research, it appeared that the most appropriate next step was to upgrade the kernel. So I did, and it worked (works). But what about Firefox 4?</p>\n<p>Firefox 4 is an amazing upgrade. Little did I know that upgrading to Firefox 4 would transition my state to an X server without any input capabilities - i.e. <strong>UPGRADE TO 10.10 - mouse and keyboard not working</strong>. Right - nowhere and nohow.</p>\n<p>What next? A recovery boot - netroot - to upgrade <strong>everything</strong> to the \"N-stage\" of Ubuntu:</p>\n<pre class=\"terminal\">\napt-get dist-upgrade\n</pre>\n<p>A long time later... my machine boots up... and works... but my AWESOME WINDOW MANAGER is GONE!!!!</p>\n<p>But wait, this environment is not bad. Wow, its good!</p>\n<h4>Update = Not Awesome</h4>\n<p>So after enjoying natty for a moment, I found myself wanting AWESOMe back immensely, so I found <a href=\"http://ubuntuguide.net/ubuntu-11-04-natty-login-to-classic-gnome-2-desktop\">this</a>, which brought me back to normal gnome, but no awesome. Ugh.</p>\n<h4>Update #2 - Its Not That Hard</h4>\n<p>I shouldn't have scorned so easily - its actually not that difficult to get the Lua-energized Awesome window manager cooperating with Gnome in ubuntu 11.xometin aka natty the narwhale.</p>\n<p>Or at least it wasn't too bad for me. Here's what I wrote on launchpad:</p>\n<blockquote class=\"svxlb\">\nAlbert Lash wrote 2 hours ago: \t#7\nSame here... I upgraded to FF4, then had to upgrade to natty, enjoyed the new GUI for a bit, then needed my awesome wm back, so I logged into Ubuntu Gnome classic from gdm, only to find awesome gone. :-(\nHopefully I can figure it out. If I do, I'll post back. If I can't, I'll check back!\nAlbert Lash wrote 2 hours ago: \t#8\nThat wasn't so bad... I restarted, chose awesome from the environment menu option list at the bottom of the login screen - that produced awesome, but no gnome, so I restarted, chose Ubuntu Classic - (not the \"no effects\" choice).\nNote: I also set awesome as my window manager again with gconf in the midst of all that:\nhttps://awesome.naquadah.org/wiki/Quickly_Setting_up_Awesome_with_Gnome\n</blockquote>\n<p>¥</p>","frontmatter":{"title":"Ubuntu 10.10 Is Terrific WOW"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2011/2011-05-03-ubuntu-1010-is-terrific---wow/"}}