{"data":{"markdownRemark":{"html":"<p>A couple of ideas regarding server event management:</p>\n<ul>\n<li>monit</li>\n<li>inotify / incrond</li>\n<li>libpam-script</li>\n<li>cron</li>\n<li>logcheck</li>\n<li>Other file scanning - fail2ban</li>\n<li>rungetty</li>\n<li><a href=\"http://www.docunext.com/wiki/Daemontools\">daemontools</a></li>\n<li>knockd</li>\n<li>ldirectord</li>\n<li>csync2</li>\n<li>ssh - sshproxy, pssh, rssh, sshfp, clusterssh, autossh</li>\n<li>tentakel</li>\n<li>puppet, bcfg2, Cfengine</li>\n</ul>\n<p>Init is something that has many people annoyed - Apple replaced it with launchd, Ubuntu replaced it with Upstart, and there is another project called Initng.</p>\n<p>But I really like init - its so simple! And simple is good.</p>\n<p>On the other hand, its limited. What happens one the machine has completed booting up? Events can come from many sources, so how should various jobs or processes be triggered? That question immediately leads to a complicated path, so its easier to break it up into smaller pieces.</p>\n<p>Events, triggers, and tasks/jobs/processes, these all have complex relationships and dependencies - sounds like a job for XML! Thinking about all of this reminds me of phing, the php version of ant.</p>\n<p>Somewhat related: shell scripts that exit with non-zero values indicate failure, which can influence other shell scripts. <a href=\"http://www.hsrl.rutgers.edu/ug/shell_help.html\">Thanks to this handy page on shell scripts</a>!</p>\n<p>I just read up on \"start-stop-daemon\". I'm a little disappointed to learn that it isn't a more standard unix tool.</p>\n<h4>Top Level Triggers</h4>\n<p>User logins (libpam-script), file alterations (incron / inotify / gamin / fam), time lapses (cron / polling), and process status changes (monit / init / rungetty). One problem I see with these at the moment, is that they are all internal events and monitors. What type of external events could be used as a trigger? It might have to be poll based, but it could also be triggered by a \"user login\". For example, an event on a remote machine could trigger an ssh script to login to another machine, to either touch a file which would trigger inotify or to run a script initiated by libpam-script.</p>\n<p>Another possibility is a network bases syslog-ng setup. Really any network daemon which could listen on a network port, provide some level of security, and trigger an internal event. Even scp or ftp could work. Maybe an anonymous FTP server which could receive files, then checksum them, decrypt them, and... yeah that's a little complicated!</p>\n<h4>Dependency Triggers</h4>\n<p>To keep this clear, I'll use an example. A web template gets updated, and all the cached web pages that depend on it need to be rebuilt. Or a database record gets updated, and data needs to then be formatted, exported, and processed. My initial thought is that these types of relationships would be documented in XML files, but also with dynamic scripts. Something to think about...</p>\n<h4>Monitoring Event Triggered Tasks</h4>\n<p>What happens if an event occurs, which triggers a task, but then the task fails?</p>\n<p><strong>Related Links</strong></p>\n<p><a href=\"http://en.wikipedia.org/wiki/Comparison_of_open_source_configuration_management_software\">http://en.wikipedia.org/wiki/Comparison<em>of</em>open<em>source</em>configuration<em>management</em>software</a></p>\n<p>¥</p>","frontmatter":{"title":"Server Event Management","date":"2009-01-06T00:00:00.000Z"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2009/2009-01-06-server-event-management/"}}