{"data":{"markdownRemark":{"html":"<p>NetFirms has always been slow for me, and so when I tried to connect to one of my blogs yesterday and was greeted with a database connection error, I decided to cut the relationship early.</p>\n<p>To do so, I'm transferring the two domains I registered with them to GoDaddy. I initiated the transfer without issue, but the transfer was denied. I'm wondering if someone at Netfirms did this, but the fact that GoDaddy reports it was unable to find an email address for the domain makes me think it could be another issue.</p>\n<p>At this state, I can't make any changes to the transfer request at GoDaddy, so I've emailed them for support:</p>\n<blockquote>Please delete the transfers for <a href=\"http://toobinator.com\">toobinator.com</a> and <a href=\"http://graphitect.net\">graphitect.net</a>. No options will work, no matter what option I select it says it cannot complete the operation.\n<p>I have the authorization code but not the transaction code. </blockquote></p>\n<p>They sent this back to me today:</p>\n<blockquote>Dear Sir/Madam-\n<p>Thank you for contacting Online Support.</p>\n<p>I have requested that a refund be applied to your account as per your request. As some of our services are non-refundable, this does not guarantee that the refund will be given. The request must be approved by our billing department. Please allow 48 hours for my request to be processed and for the credit to appear in the order history of your account, if approved.</p>\n<p>Once the credit appears in your Go Daddy account, please allow 5-7 business days to see the funds applied to the associated payment method. If we are not able to process a refund for this service you will be contacted. Thank you for your patience and understanding in this matter.</p>\n<p>Sincerely,</p>\n<p>Chris P.\nOnline Support\nTechnician</blockquote></p>\n<p>Now I'm trying to transfer the domains to DynDns.org. They have always been reliable and their prices are decent, but not nearly as good as GoDaddy's.</p>\n<p>UPDATE: The transfers went through to Dyndns.com without any issues, and GoDaddy refunded my transfer payments. :-)</p>","frontmatter":{"title":"Transferring Domains from NetFirms to GoDaddy","date":"April 8th, 2007"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2007/2007-04-08-transferring-domains-from-netfirms-to-godaddy/"}}