{"data":{"markdownRemark":{"html":"<p>As a continuation to my post on setting up <a href=\"http://www.docunext.com/blog/2011/04/rails-3-apps-via-rvm-centos-on-openvz-defined-by-puppet.html\">Rails 3 apps via RVM, CentOS on OpenVZ, Mastered by Puppet</a>, this is an entry about doing something similar with <a href=\"http://www.docunext.com/wiki/LXC\">LXC</a>.</p>\n<p>I will first mention that the networking configuration I'm using is sub-optimal. I've setup lxc on my notebook which uses wireless, and bridging doesn't like it (in fact, it surprisingly appears that recent updates to the linux kernel do not support bridging with wireless devices). See the <a href=\"http://www.docunext.com/wiki/LXC\">Docunext wiki page about LXC for more information about my LXC networking configuration, as well as building the container itself</a>.</p>\n<p>After installing RVM in the container and using it to download, configure, compile, and install Ruby 1.9.2, I then proceeded to use apt-get to install Puppet.</p>\n<pre class=\"terminal\">\napt-get install puppet\n</pre>\n<p>That went fine, but when I tried to check <tt>syslog</tt> for details, I realized I don't have a syslogger installed yet. Right - lxc-create installs a minimal debian system. I try to install rsyslog:</p>\n<pre class=\"terminal\">\napt-get install rsyslog\nReading package lists... Done\nBuilding dependency tree\nReading state information... Done\nThe following extra packages will be installed:\n  cron exim4 exim4-base exim4-config exim4-daemon-light heirloom-mailx liblockfile1 libpcre3 lockfile-progs logrotate\nSuggested packages:\n  anacron checksecurity mail-reader eximon4 exim4-doc-html exim4-doc-info spf-tools-perl swaks rsyslog-mysql rsyslog-pgsql rsyslog-doc rsyslog-gnutls rsyslog-gssapi\n  rsyslog-relp\nRecommended packages:\n  mailx\nThe following NEW packages will be installed:\n  cron exim4 exim4-base exim4-config exim4-daemon-light heirloom-mailx liblockfile1 libpcre3 lockfile-progs logrotate rsyslog\n0 upgraded, 11 newly installed, 0 to remove and 0 not upgraded.\nNeed to get 3031 kB of archives.\nAfter this operation, 6713 kB of additional disk space will be used.\nDo you want to continue [Y/n]? n\nAbort.\n</pre>\n<p>Argh. It wants to install exim4. For this container I'd like to use nullmailer:</p>\n<pre class=\"terminal\">\napt-get install nullmailer\nReading package lists... Done\nBuilding dependency tree\nReading state information... Done\nThe following extra packages will be installed:\n  klogd sysklogd\nThe following NEW packages will be installed:\n  klogd nullmailer sysklogd\n0 upgraded, 3 newly installed, 0 to remove and 0 not upgraded.\nNeed to get 196 kB of archives.\nAfter this operation, 762 kB of additional disk space will be used.\nDo you want to continue [Y/n]? n\nAbort.\n</pre>\n<p>Wait! That wants to install klogd. Ugh. OK, let's try again:</p>\n<pre class=\"terminal\">\napt-get install nullmailer rsyslog\nReading package lists... Done\nBuilding dependency tree\nReading state information... Done\nThe following extra packages will be installed:\n  cron heirloom-mailx liblockfile1 lockfile-progs logrotate\nSuggested packages:\n  anacron checksecurity rsyslog-mysql rsyslog-pgsql rsyslog-doc rsyslog-gnutls rsyslog-gssapi rsyslog-relp\nRecommended packages:\n  exim4 postfix mail-transport-agent mailx sysklogd system-log-daemon\nThe following NEW packages will be installed:\n  cron heirloom-mailx liblockfile1 lockfile-progs logrotate nullmailer rsyslog\n0 upgraded, 7 newly installed, 0 to remove and 0 not upgraded.\nNeed to get 861 kB of archives.\nAfter this operation, 2478 kB of additional disk space will be used.\nDo you want to continue [Y/n]?\n</pre>\n<p><strong>YES!</strong> I am so glad that apt has super cow powers, aren't you?</p>","frontmatter":{"title":"A GNU Debian LXC Puppet"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2011/2011-05-22-an-lxc-puppet/"}}