{"data":{"markdownRemark":{"html":"<p>Plug computing is really coming of age, and in my opinion - that's very cool!</p>\n<h4><strong>What is a Plug Computer?</strong></h4>\n<p>A plug computer is often described as a small, low-power computer that has a form factor that allows it to be plugged directly into a power outlet.</p>\n<p>They've been around for awhile as specialty hardware. I think the first one I saw was called JackPC, and that was designed more as a computer that resembled a wall outlet than something that would get plugged into a wall outlet.</p>\n<p>More recent plug computers look almost like power adapters, aka wall warts. The one that seems to have gathered the most attention is called the <strong>SheevaPlug</strong>. It runs on the ARM9 architecture and is marketed by Marvell and their system-on-chip called Kirkwood 6281.</p>\n<h4><strong>Plug Computer Power Consumption</strong></h4>\n<p>I've read that the SheevaPlug only uses 5 watts of power. If so, that would really be amazing because its reportedly quite a little powerhouse, too, in terms of processing power.</p>\n<h4><strong>Plug Computer Uses</strong></h4>\n<p>I'd first guess that a very useful application for a plug computer would be wireless - using the plug as a node in a wireless mesh network, or simply acting as a repeater node to extend wireless range.</p>\n<p>After that, the sky is the limit! Prior to plug computers, enthusiasts have been modifying wireless routers with linux to act as micro-servers, even using some that have support for USB as network attached storage devices.</p>\n<p>This brings up two important points about some plug computers:</p>\n<ul>\n<li>USB 2.0 support</li>\n<li>eSata support</li>\n</ul>\n<p>The eSata support is really, really awesome!</p>\n<h4><strong>Plug Computer Pricing</strong></h4>\n<p>This is another important factor when it comes to plug computers: they are inexpensive! The SheevaPlug development kit can be purchased for only $99 USD!</p>","frontmatter":{"title":"Plug Computers","date":"July 9th, 2010"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2010/2010-07-09-plug-computers/"}}