{"data":{"markdownRemark":{"html":"<p>I'm trying to get pfSense to work with a soekris lan1621 card which has two sis interfaces. Everything seems fine, but I get incoming errors, no traffic.</p>\n<p>Very strange. I am able to get it to work without DHCP on the embedded version of pfSense, but not the full version. Very, very strange.</p>\n<p>I'm planning to do more testing tomorrow, so I'll have more details then.</p>\n<p>While I'm working on pfSense, I looked into upgrading the 1.2-RC3 I have running on a WRAP at my house. Unfortunately, it appears that pfSense upgrades don't work on the embedded version. Bummer! When researching this, I read on the pfSense blog that 90% of their downloads are for the full version. I'm surprised by this, I would have thought that more people would want the embedded version.</p>\n<p>I just posted my experience about this to the pfsense forums:</p>\n<blockquote>FYI - When running pfSense full on a PC Chips V21G mainboard (VIA C7, similar to pc2500e) with a Soekris lan1621 card (Natsemi sis driver with 2 ports), the card and ports are recognized, but non-operable.\n<p>I am able to assign addresses to sis0 and sis1, but only attain errors on tx. I switched out the card for an intel and it works fine. The same behavior is seen on both the LAN and WAN side.</p>\n<p>The onboard nic, a via rhine, works flawlessly.</p>\n<p>Also, the lan1621 ports are operable on the embedded version, but do not work with DHCP, as either a client or host.</p>\n<p>Seeing how obscure this scenario is, I'm not looking for an answer, but I figured I'd share my experience with the community. I'm going to try out the card on an intel little valley and see how that works. I believe that has an sis port on board.</p>\n<p>Nice work on RC5, I'm trying it out now with the intel card! :-)</blockquote></p>\n<p>¥</p>","frontmatter":{"title":"pfSense and lan1621","date":"February 14th, 2008"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2008/02/pfsense-and-lan1621/"}}