{"data":{"markdownRemark":{"html":"<p>I setup a few wikis with Ikiwiki before I became zealous about Git and used Subversion instead.</p>\n<p>I'll likely convert them over to git at some point, so I'm doing a little thinking / research on the topic.</p>\n<p>I've definitely converted subversion repositories to git before, but no ikiwiki setups. I'm not entirely well versed with ikiwiki, but I know there is more going on that a simple repository.</p>\n<h4><strong>Why convert from Subversion to Git?</strong></h4>\n<p>I want to convert from Subversion to Git because Git is very efficient when it comes to storage, and I'm also interested in using Grit, the Ruby git library, to some degree. I sure have had a good time using <a href=\"http://www.docunext.com/wiki/Git-wiki\">Git-wiki</a>!</p>\n<p>That might seem like a little ironic, seeing how Ikiwiki is written in Perl, but it really shouldn't matter.</p>\n<h4>One Wiki Converted!</h4>\n<p>I went ahead with the Neocarz.com wiki, but I didn't actual convert the svn repository to git, I just rebuilt it using the ikiwiki auto setup. There wasn't too much history, and I just wanted to get it done.</p>\n<p>Actually, this was a very good exercise for me. Turns out that while Ikiwiki has some amazing capabilities, it can be a very simple wiki compiler, like how chronicle is for blogs. Cool!</p>\n<h4>More Ikiwiki Subversion to Git Conversion Notes</h4>\n<p>A testament to the quality design of Ikiwiki, the back-end doesn't really matter. Joey has setup Ikiwiki to support a version control system, but not require one. Once I manually converted the subversion repositories to a single git repository, I updated the ikiwiki configurations and was good to go.</p>\n<p>More specifically, the ikiwiki configuration file specifies a repository url as well as a wiki source url. It assumes the wiki source is formatted as markdown.</p>\n<h4>UPDATE</h4>\n<p>I've converted a bunch of subversion based ikiwiki wikis and I'm way glad I did! I can actually use <a href=\"http://www.docunext.com/wiki/Git-wiki\">git-wiki</a> to edit them, and ikiwiki to publish them. How cool is that!!</p>","frontmatter":{"title":"Ikiwiki How to Switch from Subversion to Git","date":"March 16th, 2010"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2010/2010-03-16-ikiwiki-how-to-switch-from-subversion-to-git/"}}