{"data":{"markdownRemark":{"html":"<p>I've been doing a lot of work with my blogs lately. Like Docunext, I have many\nblogs published by MovableType, which I like, but have grown weary of.\nThere have been some missteps on the part of Six Apart (in my opinion), like the\nfact that backups cannot be restored by newer versions of Movable Type - argh!\nPlus, its slow.</p>\n<p>However, the data model is awesome, and so are the templating and plugin engines\n(though I really do not like the custom tagging and non-xml compliant markup),\nso its a reliable beast. Its done its job well for several years.\nThe spirit of the times, as they are, have encouraged me to migrate some blogs\naway from Movable Type. Where am I migrating them to?</p>\n<p>I have some blogs on a very old version of Wordpress, and although Wordpress has\ndrastically improved since then, I was looking for something different. Drupal\nis awesome too, but I feel that is more of a development platform for projects\nof medium complexity. Just not what I was looking for in a blog engine.\nAgain, where did I migrate my blogs to? I don't have a definite target platform,\nyet, but here's a few that I'm trying out:</p>\n<ul>\n<li>For <a href=\"http://www.neothreadz.com/\">NeoThreadz</a>, I'm trying out Middleman. I like it - although it runs on Sinatra / Padrino, it has a Rails-y feel to it.</li>\n<li>For a bunch of sites, including <a href=\"http://www.informedusability.com/\">Informed Usability</a> and <a href=\"http://www.cyberpulpit.com/\">Cyber Pulpit</a>, I'm using Jekyll. Jekyll rocks, really, but I think I want something a tad more dynamic on the development side. Also - I should mention I use Octopress on top of Jekyll. Octopress is sweet, but it almost does too much. Its also nice that Jekyll has importers to convert from Movable Type. I used it to convert <a href=\"http://www.neothreadz.com/\">NeoThreadz</a> even.</li>\n</ul>\n<p>N.B. - Both Middleman and Jekyll are static blog compilers, and both run on\nRuby, my language of choice these days. Jekyll is very stable and has been around\nfor awhile. Middleman is newer, and is nearing \"1.0\" status. I'm looking forward\nto a stable release of Middleman - it will include the blog plugin.</p>\n<p>What about <a href=\"http://www.neocarz.com/\">NeoCarz</a>? Glad you asked! It is using\nBrogue, a Rails 3 blog engine based off of rails_blog_engine. I'm quite\npleased with it so far, but it needs more input from the community to improve.</p>\n<p>And for wikis? Thankfully there is a somewhat standard format evolving for\ngit-based wikis, thanks to ikiwiki, git-wiki, and friends, so I built wikee,\nagain a Rails 3 engine, but for wikis! Its mostly based off of the Sinatra app\ngit-wiki, and it works quite nicely, too. There are several things I need to do\nthere, though, like include FrontMatter, use the GitModel ORM, and cache the\npages and uncache them with a sweeper or an observer.</p>\n<p>I have wikee and brogue plugged into the awesome xapian_db gem, so search is\nworking quite well, too!</p>\n<p>If you are interested in Rails 3, wikis, or blogs - check out my projects and\nlet me know what you think of them:</p>\n<ul>\n<li><a href=\"https://github.com/docunext/brogue\">Brogue</a></li>\n<li><a href=\"https://github.com/docunext/wikee\">Wikee</a></li>\n</ul>","frontmatter":{"title":"Static Blog Publishers and Rails Blog Engines"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2011/2011-11-30-static-blog-publishers-and-rails-blog-engines/"}}