{"data":{"markdownRemark":{"html":"<p>This is an interesting challenge - and I love interesting challenges! How can I convert markdown to an openoffice document, or a PDF to a Word Doc? Easy! I use markdown as my source format when writing documents that I plan to present in a professional manner.</p>\n<p><em>I know what you are thinking, \"Markdown? For documents?\"</em></p>\n<p>YES!! Thanks to the awesomeness of John Macfarlane's <strong><a href=\"http://johnmacfarlane.net/pandoc/\">Pandoc</a></strong>! Thanks to this terrific project, I'm able to use Markdown for simple stuff, and LaTeX for complex stuff (its a balance).</p>\n<p>That solution works <em>really</em> well, for generating PDFs... but what about other formats? Like converting from <strong>pdf</strong> to <strong>odt</strong>, even <strong>doc</strong> (yuck).</p>\n<p>Last night I worked on this challenge for quite some time. I tried several methods, including <tt>mk4ht oolatex mydoc.mdwn</tt>, but there was always something clunky going on.</p>\n<p>Eventually I stumbled upon <strong>latex2rtf</strong>. How's that work? Again, thanks to Pandoc, I'm able to convert a markdown / LaTeX document to straight LaTeX, allowing me to then use latex2rtf. That was the fastest and simplest, so even though there were still some formatting issues, I decided it was my best option.</p>\n<p>Eventually to make everything work, I had to simplify my LaTeX commands, excluding some really sweet packages, like tabularx and fancyhdr, and even seemingly standard ones like parskip! 'Sup with that??</p>\n<p>So thanks much to the folks behind markdown, Pandoc, LaTeX, openoffice, and latex2rtf!</p>\n<p>Here's a snibbet of how I've got the script set up:</p>\n<pre class=\"terminal\">\npandoc --template=../../../.pandoc/templates/odt.template my_markdown_doc.txt -s -o my_markdown_doc.tex\nlatex2rtf my_markdown_doc.tex\nmv *.rtf $TARGET/my_markdown_doc.rtf\n</pre>\n<h4>References:</h4>\n<ul>\n<li><a href=\"http://moldyn.blogspot.com/2009/04/latex-to-odt-conversion-tips.html\">http://moldyn.blogspot.com/2009/04/latex-to-odt-conversion-tips.html</a></li>\n<li><a href=\"http://ubuntuforums.org/showthread.php?t=1033441\">http://ubuntuforums.org/showthread.php?t=1033441</a></li>\n</ul>","frontmatter":{"title":"Markdown to ODT PDF to Doc","date":"2011-03-09T00:00:00.000Z"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2011/2011-03-09-markdown-to-odt/"}}