{"data":{"markdownRemark":{"html":"<a href=\"http://www.gnucash.org/\">\n<p>I'm trying to install a more recent version of GnuCash on an Ubuntu machine using these instructions:</p>\n<p><a href=\"http://ubuntuforums.org/showthread.php?t=222221\">http://ubuntuforums.org/showthread.php?t=222221</a></p>\n<p>Actually I noticed it was building an old version of GnuCash so I'm trying the packages mentioned <a href=\"http://ocaoimh.ie/2006/09/14/gnucash-20-on-ubuntu-dapper/\">here</a>.</p>\n<p>I'll post copies of those files here because the place you download them from is obnoxious! <del>gnucash<em>201-1</em>i386deb.gz</del><del>gnucash-common<em>201-1</em>alldeb.gz</del></p>\n<p>Once you've got 'em downloaded, follow the <a href=\"http://ocaoimh.ie/2006/09/14/gnucash-20-on-ubuntu-dapper/\">GNUCash 2.0 on Ubuntu Dapper instructions at Holy Shmoly</a>.</p>\n<p><strong>Note</strong>: I have no idea where these files came from, and I strongly recommend you consider this when using these files. It may not be such a good idea to use software of unknown origins for any reason, and if you do, it might be a good idea to only use it for evaluation purposes. These downloads come with the usual NO WARRANTY!</p>\n<p>UPDATE: Even better, download them from a debian mirror, like this one: <a href=\"http://http.us.debian.org/debian/pool/main/g/gnucash/gnucash_2.0.5-1_i386.deb\">http://http.us.debian.org/debian/pool/main/g/gnucash/gnucash<em>2.0.5-1</em>i386.deb</a> (though there are ubuntu / debian issues with that one, don't use it)</p>\n<p><a href=\"http://packages.ubuntu.com/cgi-bin/search_packages.pl?keywords=gnucash&searchon=names&subword=1&version=feisty&release=all\">Search Ubuntu packages for GnuCash</a></p>\n<h3>EVEN BETTER WAY TO USE GNUCASH ON UBUNTU</h3>\n<p>Sorry for the caps, just want to make sure you don't waste your time on the stuff above. Just use Edgy Eft if you can. Packages for GnuCash 2+ are available there. :-) I finished the update from dapper to edgy today and the install of gnucash went fine.</p>\n<p>P.S. - I just found this <a href=\"http://cashutil.sourceforge.net/\">CashUtil - a command line interface to GnuCash</a>. Very cool!</p>\n<p>UPDATE November 2007: I removed the above mentioned files, use the native Ubuntu packages instead.</p>","frontmatter":{"title":"GnuCash on Ubuntu","date":"2007-05-23T00:00:00.000Z"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2007/2007-05-23-gnucash-on-ubuntu/"}}