{"data":{"markdownRemark":{"html":"<p>This is awesome, and soon to be a part of our blog sites!</p>\n<p>They are using scanned words from old books which OCR (optical character recognition or something like that) was unable to correctly decipher. By feeding this to humans, Carnegie Mellon is helping OCR software get better. :-)</p>\n<p>Hmmm. I just read through the reCAPTCHA terms of service, and wonder did a lawyer actually write this:</p>\n<blockquote>     Ownership of Data and Information; Carnegie Mellon's Use of Personally-Identifiable Information. All data and information generated from the access and use of the Website and Service, including any image solved (whether or not correct) shall be the property of Carnegie Mellon, and no third party, including you, shall have the right to own such data and information, or use such data or information except as expressly authorized by these Terms and Conditions. By using the Website and Service, you automatically assign to Carnegie Mellon any rights in the data or information generated from the access and use of the Website and Service, including any image solved (whether or not correct) of yours and third party users of your website providing interpretations of images (and you agree to make sure that the third party users of your website assign these rights in the data and information to Carnegie Mellon).</blockquote>\n<p>That's one of the more ridiculous fine prints I've read in awhile. How in the world could any site owner sanely agree to \"make sure that third party users of [their] website assign [those] rights in the data and information to Carnegie Mellon\"? That is a practically impossible feat.</p>\n<p>Sorry Carnegie Mellon, everybody doesn't win, especially with wacky terms like the ones you are including in your service.</p>\n<p>I believe that the <a href=\"http://www.docunext.com/blog/2007/10/server-based-comment-spam-protection.html\">mod_defensible solution described here is a better solution than both Spam Karma 2 and reCAPTCHA</a>. Of course I'll have to try it out!</p>\n<p>¥</p>","frontmatter":{"title":"reCaptcha","date":"2007-10-30T00:00:00.000Z"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2007/2007-10-30-recaptcha/"}}