{"data":{"markdownRemark":{"html":"<p>I'm testing out DRBD and OCFS2. When both machines are running and drbd is primary on both machines, everything works fine. However, when I bring down one machine, the other one still works fine, but when I bring the other machine back up, both seems to crash.</p>\n<p>When I bring one machine down, the other one says this:</p>\n<pre class=\"terminal\">\nSVN Revision: 2947 build by root@deb4vde, 2007-09-02 15:46:47 0: cs:WFConnection st:Primary/Unknown ds:UpToDate/DUnknown C\nr---    ns:404949 nr:240 dw:535 dr:405156 al:0 bm:72 lo:0 pe:0 ua:0 ap:0\n        resync: used:0/31 hits:25256 misses:36 starving:0 dirty:0 changed:36\n        act_log: used:0/257 hits:343 misses:0 starving:0 dirty:0 changed:0\n</pre>\n<p>then when the other one comes up:</p>\n<pre class=\"terminal\">\nversion: 8.0.4 (api:86/proto:86)\nSVN Revision: 2947 build by root@deb4vde, 2007-09-02 15:46:47 0: cs:Connected st:Primary/Secondary ds:UpToDate/UpToDate C\nr---    ns:429606 nr:240 dw:622 dr:429789 al:0 bm:79 lo:0 pe:0 ua:0 ap:0\n        resync: used:0/31 hits:26787 misses:43 starving:0 dirty:0 changed:43\n        act_log: used:0/257 hits:419 misses:0 starving:0 dirty:0 changed:0\n</pre>\n<p>So then, I need to synchronize them. Actually, I guess I just needed to do this:</p>\n<p>drbdadm primary r0</p>\n<p>on the machine which was brought down and back up again. Then I need to do: /etc/init.d/o2cb online xcluster</p>\n<p>and</p>\n<pre class=\"terminal\">\nmount -t ocfs2 /dev/drbd0 /mnt/\n</pre>\n<p>Strange - when I restart the second machine, my shell on the first machine is killed and the the drbd device is unmounted, pretty much depleting any value this system could have. :-(</p>\n<p>I'm now trying:</p>\n<pre class=\"terminal\">\n         after-sb-0pri   discard-older-primary;\n        after-sb-1pri   consensus;\n</pre>\n<p>That seems to help a little with the automatic rebuilding process, but one of the vm's still reboots (the current primary) when the secondary comes back online and starts to resync. That could very likely be caused by the fact that these are virtual machines, and not the real deal.</p>\n<pre class=\"terminal\">\nMessage from syslogd@deb4vde at Sun Sep  2 22:25:41 2007 ...\ndeb4vde kernel: Disabling IRQ #11\n</pre>\n<p>Grrr.</p>\n<p>Seems to be working better with just one split brain setting:</p>\n<pre class=\"terminal\">\nafter-sb-0pri discard-older-primary;\n</pre>\n<p>and a very low extants setting:  al-extents 7;</p>\n<p>This causes more writes to the meta-data, but faster resync. In my case, I'll use gigE and fast drives to counter the performance hit. With these settings, I can have the drbd device mounted via ocfs2 on both machines, reboot one, and maintain the mount on the other throughout the reboot process. Once the rebooted machine is backup, it quickly connects, synchronizes, and becomes a secondary. At that point, I can manually bring it into primary mode again, mount it, and verify that it has the updated content and restore redundancy.</p>\n<p>With a little tweaking and tuning here and there, this DRBD / OCFS2 setup will be a terrific solution for high availability. I'm amazed at how well its working on QEMU virtual machines. I can only expect better results with the real deal.</p>\n<p><a href=\"http://listas.softwarelivre.org/pipermail/psl-go/2005-December/002462.html\">http://listas.softwarelivre.org/pipermail/psl-go/2005-December/002462.html</a></p>\n<p><a href=\"http://www.docunext.com/wiki/DRBD8\">DRBD8 + OCFS2 on Debian Howto / Disorganized Notes</a></p>","frontmatter":{"title":"DRBD and OCFS2"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2007/2007-09-02-drbd-and-ocfs2/"}}